{"articles": [{"text": "A sports needle-mover in the truest sense, Canadian tennis star Bianca Andreescu has enjoyed a stunning rise on the WTA Tour.\n\nThe country and the world have joined her for the ride.\n\nAndreescu's ranking has risen exponentially in her breakout 2019 season. The television ratings have also been huge and the massive increase to her social media following is just as eye-popping.\n\n\"The rise has been tremendous but it's also been sustainable and consistent,\" said Tom Mayenknecht, a Vancouver-based marketing communications executive and sport business commentator.\n\nAndreescu's Instagram account had a modest 12,600 followers at the end of 2018, when she was ranked No. 152 in the world and still looking for her first WTA title.\n\nThe 19-year-old native of Mississauga, Ont., added 58,000 followers in the month of March after her breakthrough win at the BNP Paribas Open in Indian Wells, Calif. Her Rogers Cup crown last month in Toronto helped boost her follower total to over 197,000. Andreescu's recent U.S. Open title and the media blitz that followed rocketed that number to 644,000 and counting.\n\nMike Naraine, an assistant professor with Brock University's department of sport management, said Andreescu has picked her spots nicely with social media posts, helping her build a strong brand with a growing base of supporters.\n\n\"It allows her to draw upon a new base of partners,\" Naraine said from Melbourne in a recent interview. \"They look at her and say, 'Wow, there is this new demographic that's young, that's hip, that's very active in the sports community. We can leverage her visibility as a strong Canadian female star to develop our product.\"'\n\nAndreescu already has anchor sponsors in Nike, BMW, Head and Rogers. A spokesman for the Octagon sports and entertainment agency said Andreescu is expected to make announcements on two new major sponsors over the coming weeks.\n\n\"It's a great journey so far but hopefully only the beginning,\" her agent, Jonathan Dasnieres de Veigy, said from Paris.\n\nCurrently ranked fifth in the world, Andreescu will soon return to action at the China Open in Beijing. The US$8.29-million Premier Mandatory-level event begins Saturday and runs through Oct. 6. Andreescu will face world No. 51 Aliaksandra Sasnovich of Belarus in the first round.\n\nIt will be her first tournament since defeating Serena Williams in the U.S. Open final three weeks ago, a win that sent her into another stratosphere. She pocketed a cool US$3.85 million for the win at the final Grand Slam of the season in New York and made high-profile television appearances on \"The View,\" \"The Tonight Show\" and \"Good Morning America\" among others.\n\n\"I'm just visualizing some of the talk-show interviews that she did and the way she handled herself, it made her real to people and accessible to people,\" Mayenknecht said. \"That's what makes her so popular.\"\n\nAndreescu seems just as natural, comfortable and grounded as a Grand Slam champion as she did nine months ago when she was battling through qualifying draws and playing lower-tier tournaments.\n\n\"She's well poised,\" Naraine said. \"It's almost as if she's been training for this her whole life. We don't necessarily see that with a lot of youth athletes.\"\n\nDasnieres de Veigy credits the \"full team\" around Andreescu that keeps her focused.\n\n\"We really want to be careful on that,\" he said. \"Our vision is very long-term. We truly believe that it was not a one-time thing but just the first step of maybe a long career. That's what we really want for her.\"\n\nAndreescu had a modest 4,000 followers on Twitter at the start of the year. That total rose over tenfold by the Rogers Cup in August and is now pushing 190,000.\n\nShe has the most mentioned Canadian athlete account of 2019, ahead of NBA prospect R.J. Barrett at No. 2 and NHL player Brad Marchand at No. 3.\n\n\"Very few Canadian athletes have ever seen such a surge in Twitter conversation within a calendar year,\" Twitter Canada communications head Cam Gordon said in an email.\n\nThe television ratings for Andreescu's 6-3, 7-5 win over Williams were off the charts. Numeris data showed an average audience of 3.4 million viewers watched the match, making it the most-watched tennis broadcast ever on TSN and RDS.\n\nThe audience peaked at 5.3 million viewers for match point, or about one in seven Canadians. ESPN also enjoyed record ratings in the United States.\n\nDAZN Canada, a streaming service, will reap the benefits of Andreescu's immediate return to the hardcourt. It is the domestic rightsholder for the China Open, although many matches will be played in the wee hours across North America.\n\nTSN has the rights to the four Grand Slams and select ATP Tour events while Sportsnet has the Rogers Cup, Davis Cup and Fed Cup. DAZN Canada has had the WTA Tour and ATP 250 tournaments on its lineup since the platform's domestic launch in July 2017.\n\nAndreescu's next set of goals includes cracking the top three in the world rankings and qualifying for the Oct. 27-Nov. 3 WTA Finals in Shenzhen, China.\n\n\"She's going to be under more and more scrutiny moving forward but there's every indication that she's got the sustainability of being a growing force for a long time,\" said Mayenknecht, a former director of communications and public relations for Tennis Canada. \"If that happens, she's only going to continue to convert a lot of fans.\"\n\nThis report by The Canadian Press was first published Sept. 27, 2019.", "article title": "Bianca Boom: Canadian tennis star Andreescu moves the needle in a big way", "meta information": {"meta description": "A sports needle-mover in the truest sense, Canadian tennis star Bianca Andreescu has enjoyed a stunning rise on the WTA Tour.", "publish date": "2019-09-27T11:26:00-04:00", "image": "https://www.ctvnews.ca/polopoly_fs/1.4613431.1569597917!/httpImage/image.jpg_gen/derivatives/landscape_620/image.jpg", "authors": ["Gregory Strong"], "meta keywords": "", "url": "https://www.ctvnews.ca/sports/bianca-boom-canadian-tennis-star-andreescu-moves-the-needle-in-a-big-way-1.4613421"}}, {"text": "(Reuters) - Global media coverage of petrol bombs, tear gas and street clashes in Hong Kong days before China wants to celebrate the 70th anniversary of the founding of the People’s Republic presents Beijing with a major public relations challenge.\n\nMillions of anti-government protesters have taken to Hong Kong’s streets for more than three months, plunging the Chinese-ruled city into its biggest crisis in decades and posing a direct challenge to its political masters in Beijing.\n\nFollowing are the key dates in Hong Kong’s protest movement and the most recent developments as reported by Reuters.\n\nSaturday Sept. 28 - The fifth anniversary of the “Umbrella” pro-democracy protests in 2014 that occupied parts of the city for 79 days. Activists are expected to mark the event with a rally in the evening at Chater Garden next to government headquarters.\n\nSunday Sept. 29 - Demonstrators plan to march from the bustling shopping and tourist district of Causeway Bay to government headquarters.\n\nMonday Sept. 30 - Activists plan a citywide general strike, calling for “no work, no lessons, no selling, no shopping.”\n\nTuesday Oct. 1 - The 70th anniversary of the founding of the People’s Republic of China. Protesters are expected to march dressed in black from Victoria Park in Causeway Bay to Chater Road near government headquarters, and authorities are likely to roll out a large security blanket as the Hong Kong government holds a low-key ceremony.\n\nActivists in Hong Kong also plan a rally outside the British Consulate and a “Black Balloon Carnival” in the shopping district of Tsim Sha Tsui.\n\nIn Beijing, President Xi Jinping will oversee a massive military parade through central Beijing. The Communist Party will be hoping the world see images of orderly troop formations and dancing civilians, rather than protests in Hong Kong.\n\nSept. 26 - Hong Kong protesters trap city leader Carrie Lam in a stadium for hours after she holds her first “open dialogue” with the people in a bid to end months of protests.\n\nSept. 22 - Hong Kong police fire tear gas to break up pro-democracy demonstrators who trashed fittings at a railway station and shopping mall.\n\nSept. 17 - Hong Kong leader Carrie Lam pledges to hold talks with the community to try to ease tensions.\n\nSept. 7 - Police fire tear gas for a second consecutive night after fending off airport protests.\n\nSept. 4 - Lam announces formal withdrawal of controversial extradition bill. Critics say it is too little, too late.\n\nSept. 1 - Hong Kong commercial centers paralyzed as protesters and police exchange petrol bombs and tear gas.\n\nAug. 31 - CCTV footage shows footage of police beating protesters on a train at Prince Edward metro station in Kowloon district as they cowered on the floor.\n\nAug. 12 - Hong Kong’s international airport grinds to a halt as protesters target terminals. China likens protests to terrorism.\n\nAug. 2 - Thousands of civil servants join anti-government protests, defying a warning from authorities to remain politically neutral.\n\nJuly 21 - Police fire rubber bullets and tear gas as demonstrations descend into chaos and protesters target Beijing’s representative office in city. Men wearing white T-shirts attack protesters at the Yuen Long metro station as they return from rally.\n\nJuly 14 - Clashes break out as tens of thousands of protesters escalate fight in suburbs.\n\nJuly 9 - Lam says extradition bill is “dead”. Critics are not convinced.\n\nJuly 1 - Hong Kong protesters smash up The Hong Kong legislative building, marking a direct challenge to Beijing.\n\nJune 9 - Hundreds of thousands rally in fresh wave of protests against the extradition bill.\n\nMay 11 - Scuffles break out in Hong Kong legislature between pro-democracy lawmakers and those loyal to Beijing.\n\nApril 28 - Tens of thousands take to the streets to protest against extradition bill.\n\nMarch 31 - Thousands march against proposed extradition bill, fearing an erosion of personal freedoms and the city’s status as an international business hub.\n\nFeb. 2019 - Hong Kong government announces it is considering a bill that would allow criminal suspects in Hong Kong to be extradited to mainland China for trial in courts controlled by the Communist Party.", "article title": "Factbox: What's next for Hong Kong's protest movement", "meta information": {"meta description": "Global media coverage of petrol bombs, tear gas and street clashes in Hong Kong days before China wants to celebrate the 70th anniversary of the founding of the People's Republic presents Beijing with a major public relations challenge.", "publish date": "2019-09-27T07:56:55+0000", "image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "authors": ["Min Read", "Reuters Editorial"], "meta keywords": "US,HONGKONG,PROTESTS,KEYDATES,Crime / Law / Justice,Hong Kong,Society / Social Issues,Factboxes,Diplomacy / Foreign Policy,China (PRC),Government / Politics,Fundamental Rights / Civil Liberties,General News,Asia / Pacific,Major News,Human Rights / Civil Rights,Emerging Market Countries,Civil Unrest", "url": "https://www.reuters.com/article/us-hongkong-protests-keydates-idUSKBN1WC0Q4"}}, {"text": "BEIJING (Reuters) - China’s foreign ministry urged Turkey on Tuesday to stop military action in Syria and “come back to the right track”. Chinese Foreign Ministry spokesman Geng Shuang made the comments at a daily briefing in Beijing.\n\nTurkey launched a military incursion into northeast Syria last week, shortly after U.S. President Donald Trump ordered U.S. troops away from the area. On Monday, Trump imposed sanctions on Turkey and called on the country to stop.", "article title": "China urges Turkey to halt military action in Syria-foreign ministry", "meta information": {"meta description": "China's foreign ministry urged Turkey on Tuesday to stop military action in Syria and \"come back to the right track\". Chinese Foreign Ministry spokesman Geng Shuang made the comments at a daily briefing in Beijing.", "publish date": "2019-10-15T07:31:39+0000", "image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "authors": ["Min Read", "Reuters Editorial"], "meta keywords": "US,SYRIA,SECURITY,TURKEY,CHINA,Israel,Russia,Defense,Syria,International Trade,Military Conflicts,Diplomacy / Foreign Policy,China (PRC),Government / Politics,General News,Asia / Pacific,Major News,Europe,Middle East,International / National Security,Conflicts / War / Peace,Emerging Market Countries,Turkey,United States", "url": "https://www.reuters.com/article/us-syria-security-turkey-china-idUSKBN1WU0PY"}}, {"text": "HONG KONG (Reuters) - The publisher of Hong Kong’s Apple Daily controlled by pro-democracy tycoon and Beijing critic Jimmy Lai on Wednesday condemned an assault on one of its reporters by unknown assailants at a restaurant.\n\nThe female reporter has been covering anti-government protests that have plunged the former British colony into its biggest political crisis in decades and posing a direct challenge to the central government in Beijing.\n\nThe journalist was attacked at a restaurant on Tuesday night by four men dressed in black and wearing the protesters’ trademark yellow helmets and masks, Apple Daily reported.\n\nThe reporter was taken to hospital, the newspaper said, but it gave no details on her condition.\n\nPublisher Cheung Kim-hung said the newspaper “has no fear of violence and will continue to defend freedom of the press and the public’s right to know”.\n\nThe Hong Kong Journalists’ Association condemned the attack, which police said was under investigation.\n\nThe incident follows an assault on democratic lawmaker Roy Kwong, who was taken to hospital on Tuesday after being punched and kicked by three men in the Tin Shui Wai district close to the border with mainland China.\n\nFellow Democratic Party lawmaker Lam Cheuk-ting said the assailants had suspected links to triads, organised criminal gangs, and the attacks were intended “to send a message to threaten all” pro-democracy lawmakers.\n\nDemonstrators are frustrated at what they see as Beijing’s tightening grip over the city, which returned to China in 1997 under a “one country, two systems” formula intended to guarantee freedoms not enjoyed on the mainland.\n\nChina has said it is committed to the arrangement and has repeatedly warned foreign countries not to interfere in an “internal affair”.\n\nSpeaking at the U.N. General Assembly in New York, U.S. President Donald Trump drew a link between resolving the U.S.-China trade dispute and Beijing’s treatment of Hong Kong.\n\nTrump said Washington was “carefully monitoring the situation in Hong Kong”.\n\n“How China chooses to handle the situation will say a great deal about its role in the world in the future. We are all counting on President Xi as a great leader,” he said, referring to his Chinese counterpart Xi Jinping.", "article title": "Apple Daily condemns attack on reporter covering Hong Kong protests", "meta information": {"meta description": "The publisher of Hong Kong's Apple Daily controlled by pro-democracy tycoon and Beijing critic Jimmy Lai on Wednesday condemned an assault on one of its reporters by unknown assailants at a restaurant.", "publish date": "2019-09-25T02:35:21+0000", "image": "https://s1.reutersmedia.net/resources/r/?m=02&d=20190925&t=2&i=1433583244&w=1200&r=LYNXMPEF8O051", "authors": ["Min Read", "Reuters Editorial"], "meta keywords": "US,HONGKONG,PROTESTS,ASSAULT,Crime / Law / Justice,Advocacy Groups / Pressure Groups / Lobbies,Hong Kong,Judicial Process / Court Cases / Court Decisions,Media and Publishing (TRBC),Crime,Transportation (TRBC),Video,Asia / Pacific,Major News,Human Rights / Civil Rights,Pictures,Media / Publishing (Legacy),Conflicts / War / Peace,Society / Social Issues,Company News,Diplomacy / Foreign Policy,China (PRC),Government / Politics,Publishing (TRBC),Fundamental Rights / Civil Liberties,General News,Emerging Market Countries,Civil Unrest", "url": "https://www.reuters.com/article/us-hongkong-protests-assault-idUSKBN1WA07M"}}, {"text": "WASHINGTON (Reuters) - White House economic adviser Larry Kudlow on Monday said it was possible U.S. and Chinese trade negotiators could make progress when they meet in Washington this week, and said Washington was open to looking at what proposals Beijing brought.\n\n“Recently some of the statements coming out of Beijing have been a little more positive. They’re been in the market buying some agriculture commodities from the U.S. - soybeans, pork and wheat and other things. That’s a good sign,” he said in a Fox News interview.\n\n“It is possible that some additional progress will be made with China toward the end of the week,” he said.", "article title": "White House adviser sees possible progress in -China trade talks", "meta information": {"meta description": "White House economic adviser Larry Kudlow on Monday said it was possible U.S. and Chinese trade negotiators could make progress when they meet in Washington this week, and said Washington was open to looking at what proposals Beijing brought.", "publish date": "2019-10-07T15:11:03+0000", "image": "https://s4.reutersmedia.net/resources/r/?m=02&d=20191007&t=2&i=1438100521&w=1200&r=LYNXMPEF96108", "authors": ["Min Read", "Reuters Editorial"], "meta keywords": "US,USA,TRADE,CHINA,KUDLOW,Computer and Electronics Retailers (TRBC),Agricultural Markets,Hong Kong,Auto and Truck Manufacturers (TRBC),Textiles / Apparel (Legacy),International Trade,Tariffs,Software (TRBC),Communications Equipment (TRBC),Economic Output,Asia / Pacific,Major News,Monetary / Fiscal Policy / Policy Makers,Economic News (3rd Party),United States,Company News,Diplomacy / Foreign Policy,Telecommunications Services (TRBC),China (PRC),Government / Politics,Aerospace / Defense (Legacy),Technology (TRBC),US Government News,Technology / Media / Telecoms,Textiles and Apparel (TRBC),Aerospace and Defense (TRBC)", "url": "https://www.reuters.com/article/us-usa-trade-china-kudlow-idUSKBN1WM1M6"}}, {"text": "BEIJING (Reuters) - Chinese President Xi Jinping warned on Sunday that any attempt to divide China will be crushed, as Beijing faces political challenges in months-long protests in Hong Kong and U.S. criticism over its treatment of Muslim minority groups.\n\n“Anyone attempting to split China in any part of the country will end in crushed bodies and shattered bones,” he told Nepal’s Prime Minister KP Sharma Oli in a meeting on Sunday, according to China’s state broadcaster CCTV.\n\n“And any external forces backing such attempts dividing China will be deemed by the Chinese people as pipe-dreaming!” he was quoted as saying.\n\nXi, the first Chinese president to visit Nepal in 22 years, arrived in Nepal on Saturday on a state visit. Both sides are expected to sign a deal expanding a railway link between the Himalayan nation and Tibet.\n\nNepal’s Oli told Xi that the country will oppose any “anti-China activities” on its soil, CCTV reported.\n\nChina, which is trying to de-escalate a protracted trade war with the United States, has seen its political authority tested by increasingly violent protests in Hong Kong against what is seen as Beijing’s tightening grip on the Chinese-ruled city.\n\nPolice in Hong Kong have used rubber bullets, tear gas and water cannons against pro-democracy demonstrators in the former British colony, which has been plunged into its worst political crisis in decades.\n\nU.S. president Donald Trump had said it would be difficult to negotiate with China if anything “bad” happens in Chinese authorities’ handling of the Hong Kong protests.\n\nTrump said he discussed the issue of Hong Kong with Chinese Vice Premier Liu He on Saturday during their latest round of talks. Both sides reached a “phase-one deal” that has raised optimism for a broader agreement although many fundamental issues remained unresolved and existing tariffs are still not lifted.\n\nWashington last week also blacklisted 28 Chinese companies over Beijing’s treatment of predominantly Muslim ethnic minorities. China has faced growing international condemnation for what it calls re-education and training centers in the remote western region of Xinjiang. Activists say they are mass detention camps holding more than 1 million ethnic Uighurs and other Muslims.\n\nBefore arriving in Nepal, Xi was in India for talks with Indian Prime Minister Narendra Modi to try to mend ties over the disputed Himalayan region of Kashmir amid scattered anti-China protests from Tibetan groups.\n\nChina sent troops into remote, mountainous Tibet in 1950 in what it officially terms a peaceful liberation and has ruled there with an iron fist ever since.\n\nThe Dalai Lama, Tibet’s spiritual leader, fled to India in 1959 after a failed uprising against Chinese rule. China brands him a dangerous reactionary who seeks to split off nearly a quarter of the Chinese land mass.\n\n(The story corrects misspelling of “shattered” in headline and second paragraph).", "article title": "China's Xi warns attempts to divide China will end in 'shattered bones'", "meta information": {"meta description": "Chinese President Xi Jinping warned on Sunday that any attempt to divide China will be crushed, as Beijing faces political challenges in months-long protests in Hong Kong and U.S. criticism over its treatment of Muslim minority groups.", "publish date": "2019-10-13T13:56:24+0000", "image": "https://s2.reutersmedia.net/resources/r/?m=02&d=20191013&t=2&i=1440326434&w=1200&r=LYNXMPEF9C0AH", "authors": ["Min Read", "Reuters Editorial"], "meta keywords": "US,CHINA,POLITICS,XI,Hong Kong,Asia / Pacific,China (PRC),Government / Politics,Economic News (3rd Party),Emerging Market Countries,Civil Unrest,United States", "url": "https://www.reuters.com/article/us-china-politics-xi-idUSKBN1WS07W"}}, {"text": "The Trump administration originally said that it would approve licenses to continue selling to Huawei after Mr. Trump met with President Xi Jinping of China in Osaka, Japan, in June. But no licenses have since been issued, raising speculation that the administration was withholding them as leverage in trade talks.\n\nA spokesman from the Commerce Department, which is responsible for the licenses, said in an email that “as of right this moment, the status quo holds.”\n\nThe administration’s decision to allow licenses could help smooth the path to a trade deal. Negotiators from the United States and China are meeting in Washington this week for their 13th round of trade talks and officials are trying to agree on terms that would address Mr. Trump’s criticisms of China’s economic practices but still be acceptable to Beijing.\n\nMr. Trump has threatened to raise tariffs on $250 billion worth of Chinese goods this month and to impose another slew of tariffs in December if Beijing does not agree to concessions that Washington has been demanding. But some in the Trump administration have been eager to avoid further tariff increases and are pushing for a more limited agreement, which would end a trade war that has dragged on for more than a year.\n\nIt is not clear whether the president would agree to a limited pact or whether such a deal can be struck. China has continued to resist many of the administration’s demands to make more transformative changes to the way it runs its economy. The two countries have been on the cusp of an agreement before, only to have the arrangement fall apart.", "article title": "Trump Green-Lights Some Sales to Huawei", "meta information": {"meta description": "The administration plans to issue licenses allowing some American companies to sell nonsensitive products to Huawei, despite its placement on a U.S. blacklist.", "publish date": null, "image": "https://static01.nyt.com/images/2019/10/09/us/politics/09dc-trade/09dc-trade-articleLarge.jpg?quality=75&auto=webp&disable=upscale", "authors": ["Ana Swanson"], "meta keywords": "", "url": "https://www.nytimes.com/2019/10/09/us/politics/trump-huawei-trade.html"}}, {"text": "In 2001, Gordon Chang, an American lawyer who had spent many years in Hong Kong and Shanghai, published a book forebodingly titled “The Coming Collapse of China.” At the time, the thesis seemed improbable, if not preposterous.\n\nIt looks a great deal less improbable now.\n\nChina — or, rather, the Chinese regime — is in trouble. Tuesday’s gigantic parade in Beijing to celebrate the 70th anniversary of the People’s Republic looked like something out of the late Brezhnev era: endless military pomp and gray old men. Hong Kong is in its fourth straight month of protests, marked and stained by this week’s shooting of a teenage demonstrator. The Chinese economy is growing at its slowest rate in 27 years, even when going by the overstated official figures.\n\nMeantime, capital is fleeing China — an estimated $1.2 trillion in the past decade — while foreign investors sour on Chinese markets. Beijing’s loudly touted Belt-and-Road initiative looks increasingly like a swamp of corruption, malinvestment and bad debt. Its retaliatory options in the face of Donald Trump’s trade war are bad and few. And General Secretary Xi Jinping has created a cult-of-personality dictatorship in a style unseen since Mao Zedong, China’s last disastrous emperor.\n\nRemember the “Chinese Dream” — Xi’s vision of China as a modern, powerful, and “moderately well-off” state? Forget it. The current task for Chinese leadership is to avoid a full-blown nightmare of international isolation, economic decline, and domestic revolt.", "article title": "Opinion | Is China Heading for Crisis?", "meta information": {"meta description": "The protests in Hong Kong accelerate the contradictions in Beijing.", "publish date": null, "image": "https://static01.nyt.com/images/2019/10/03/opinion/03stephensWeb/merlin_161940225_d01efe35-bae7-41d8-8ce3-dd8193d4a118-articleLarge.jpg?quality=75&auto=webp&disable=upscale", "authors": ["Bret Stephens"], "meta keywords": "", "url": "https://www.nytimes.com/2019/10/03/opinion/china-xi-jinping.html"}}, {"text": "Hong Kong Police shot a teen protester in the chest with live ammunition this morning, according to reports from journalists on the ground and a video that has gone viral on Facebook and Twitter. Video of the incident shows a Hong Kong police officer charging a crowd of protesters with his gun before firing a single shot.\n\n\n\nThe protester is reportedly in critical condition at Princess Margaret Hospital and will soon be transferred to Queen Elizabeth Hospital which has a cardiothoracic surgery center, according to the South China Morning Post.\n\nThe pro-democracy protester is a “Form Five” student at Tsuen Wan Public Ho Chuen Yiu Memorial College, according to SCMP, the equivalent of an 11th grader in the U.S., which would put his age somewhere around 16 years old.[Update: Police say he’s 18 years old]\n\nThe video of the shooting was captured by Campus TV in Hong Kong and shows the masked teenager approaching the police officer with a stick of some kind and swinging it at him, brushing his shirt.\n\nBut another angle on the shooting shows that the police charged at the protesters before they fought back. That video also shows the aftermath of the shooting, with the protester injured on the ground.\n\nAccording to SCMP, Hong Kong Police claim that the victim is 18 years old.\n\n“At about 4pm, a large group of rioters attacked police officers near Tai Ho Road, and they continued with their attack after officers warned them to stop. As an officer felt his life was under serious threat, he fired a round at the assailant to save his own life and his colleagues’ lives,” Police Senior Superintendent Yolanda Yu Hoi-kwan said in a Facebook message, according to SCMP. “The round hit an 18-year-old, and the area near his left shoulder was injured, and he was conscious when taken to Princess Margaret Hospital.”\n\n“The police force really did not want to see anyone being injured, so we feel very sad about this. We warn rioters to stop breaking the law immediately, as we will strictly enforce the law.”\n\nProtesters have been on the streets since June, when they were originally protesting a new law that would have made it easier for Beijing to extradite so-called criminals from Hong Kong to mainland China. Hong Kong is a semi-autonomous territory that has operated under a “one country, two systems” arrangement since 1997, but is scheduled to formally become part of China in 2047. The demands from protesters have widened since June and now include a call for universal suffrage.\n\n\n\nToday marks the 70th anniversary of the founding of the Chinese Communist Party, and celebrations are widespread in mainland China. But Hong Kongers have thrown a wrench in Beijing’s National Day celebrations by denouncing the brutality of the Chinese government. Today’s shooting by Hong Kong Police puts that brutality on full display.\n\nBeijing has done everything they can to stop the protests, including cyberattacks on protesters’ organizing tools. But Hong Kongers realize that this is a fight for their life and have vowed to never give up. Chinese state media was banned from running propaganda ads against the protesters, which prompted the Chinese government to complain that Facebook and Twitter were censoring China. The country, it should be noted, bans Facebook and Twitter behind China’s Great Firewall.\n\nUpdate, 8:10am: This post has been updated with a statement from Hong Kong Police.", "article title": "Viral Video Shows Hong Kong Police Shooting Teen Protester in the Chest", "meta information": {"meta description": "Hong Kong Police shot a teen protester in the chest with live ammunition this morning, according to reports from journalists on the ground and a video that has gone viral on Facebook and Twitter. Video of the incident shows a Hong Kong police officer charging a crowd of protesters with his gun before firing a single shot.", "publish date": null, "image": "https://i.kinja-img.com/gawker-media/image/upload/c_fill,f_auto,fl_progressive,g_center,h_675,pg_1,q_80,w_1200/hocwjn44lwvgfjhmjsvs.jpg", "authors": [], "meta keywords": "hong kong, protests, viral video, facebook, youtube, twitter, social media, democracy, beijing, Tsuen Wan Public Ho Chuen Yiu Memorial College", "url": "https://gizmodo.com/viral-video-shows-hong-kong-police-shooting-teen-protes-1838655638"}}, {"text": "BEIJING - Beijing's new futuristic airport that resembles a giant starfish -- opened days before the country celebrates the 70th anniversary of communist rule -- promises to transform the Chinese capital into a major Asian aviation hub.\n\nLocated 46 kilometers (29 miles) south of Tiananmen Square, Beijing Daxing International Airport will be able to handle 45 million passengers by 2021, with plans for 72 million by 2025 and 100 million by 2040.\n\nIt was opened by President Xi Jinping Wednesday, but had an immediate hitch when its maiden commercial flight -- an A380 superjumbo heading to the southern city of Guangzhou -- was delayed by nearly 30 minutes.\n\nAbout a decade ago, Daxing was a sleepy suburb of dusty farmland and cramped quarters home to migrant workers building roads and skyscrapers in the city.\n\nNow -- with the airport code PKX -- Daxing is seen as an embodiment of the \"Chinese dream\" Xi has offered his fellow citizens.\n\nAt 700,000 square meters (173 acres) -- about the size of 100 football pitches -- the new structure will be one of the world's largest airport terminals.\n\nSo far only China United Airlines has shifted their operations to the new hub but operations manager Wang Qiang said another seven domestic and eight international airlines would arrive in the \"near future.\"\n\nBritish Airways, Cathay Pacific and Finnair have already announced new routes to tap into its potential.\n\nThe SkyTeam alliance -- which includes Delta, Air France and Dutch airline KLM -- was also expected to move, along with local partners Eastern Airlines and China Southern Airlines.\n\nThe building was designed by Iraqi-British architect Zaha Hadid, who died in 2016.\n\nThe central atrium, with curves like a rolling landscape, is supported by eight giant columns and skylights filling the terminals with natural light.\n\nRelatives and friends can also watch as their loved ones proceed to boarding gates through a viewing gallery.\n\nAn underground train station and metro line will allow travelers to reach Beijing city within 20 to 30 minutes.\n\nThe project cost 120 billion yuan ($17.5 billion), or 400 billion yuan if rail and road links are included.\n\nAt full capacity, Daxing would be the world's largest single terminal in terms of traveler capacity, according to its designers.\n\nDozens of self check-in counters -- where travelers only need to scan their passports -- have been set up alongside conventional airline counters to speed up operations.\n\nTraveller Xie Hangyu said the check-in procedures were \"very smooth and very convenient.\"\n\nThe current Beijing Capital International Airport -- the world's second-largest -- is already overflowing, handling 100 million passengers last year.\n\nWith the opening of Daxing, Beijing joins a select group of cities, including Tokyo, London, Paris and New York, that have two long-haul international airports.\n\nAir transport is booming in China as living standards increase along with peoples' desire to travel.\n\nIt is expected to surpass the US to become the world's biggest aviation market by the mid-2020s, according to the International Air Transport Association.\n\nBy 2037 the country will have 1.6 billion plane journeys each year -- a billion more than in 2017, the organization estimates.", "article title": "Beijing hopes glitzy new airport will take off as aviation hub", "meta information": {"meta description": "Beijing's new futuristic airport that resembles a giant starfish -- opened days before the country celebrates the 70th anniversary of communist rule -- promises to transform the Chinese capital into a major Asian aviation hub.", "publish date": null, "image": "https://sa.kapamilya.com/absnews/abscbnnews/media/2019/reuters/09/29/china.jpg", "authors": [""], "meta keywords": "China, Beijing, Beijing Daxing International Airport, travel, aviation, Beijing hopes glitzy new airport will take off as aviation hub | ABS-CBN News", "url": "https://news.abs-cbn.com/business/09/29/19/beijing-hopes-glitzy-new-airport-will-take-off-as-aviation-hub"}}, {"text": "Ladakh is a remote and picturesque part of the region that borders China. It is further divided administratively into the Leh district, which is predominantly Buddhist, and the Kargil district, which is mostly Muslim. There have been occasional border skirmishes between India and China. On October 31, New Delhi will seize control of the region raising fears about the future in both the Buddhist and Muslim communities, although so far the tensions have been confined to cultural and political differences, without violence. However, India and China have a long history of tension in the Ladakh and Doklam regions where border disputes have led to skirmishes as recently as last month. In 1962, a war between New Delhi and Beijing was sparked in the Kashmir region spilling into Ladakh, with conflict engulfing the Himalayan territory for a month.\n\nBut the tensions have not faded since then, with ongoing disputes provoking sporadic spikes in military gesturing. In 2017, a standoff occurred at the Doklam border as India resisted a road being built in the region by China, and earlier this month, Chinese and Indian military clashed again when the Chinese People's Liberation Army objected to Indian patrols in Ladakh. Now, unease in Ladakh could be on the horizon with divides between Buddhist and Muslim communities looming. Muslim residents want to remain tied to the Kashmir Valley while Buddhists celebrate the prospect of Indian Prime Minister Narendra Modi taking control of the region on October 31. However, it has emerged that China President Xi Jinping has pushed increasingly audacious foreign policy over Ladakh, with analysts concerned that New Delhi may be losing control in the region.\n\nAshok Malik, distinguished fellow of New Delhi’s Observer Research Foundation told the Financial Times: \"Even in hitherto uncontested parts of Ladakh, the superiority of Chinese infrastructure and military capacities has seen a creeping takeover of border areas. “It is as if the effective line of actual control keeps moving a couple of inches in the direction of India. At some point, India has to say, ‘thus far and no further’.” It is also believed that Chinese military intervention in the region is breaching areas overseen by Modi's administration.\n\nBrahma Chellaney, a professor of strategic studies at New Delhi’s Centre for Policy Research told the Financial Times: \"Even before the Indian action on Jammu and Kashmir, the line of actual control between China and India in Ladakh had already become more active because of increasing Chinese aggressiveness. “In the 12 months prior to August, there had been a sharp increase in the number of Chinese military forays and incursions, and the Chinese have laid claim to several areas that are currently under Indian administrative control.\" DON'T MISS:\n\nIndia-Pakistan crisis: Fears of war after cross-border shelling [INSIGHT]\n\nIndia-Pakistan conflict: Modi's office targets Turkish shipyard  [ANALYSIS]\n\nSouth China Sea tensions surge: Vietnam urges India to back them [BREAKING]\n\nThis weekend, Xi Jinping will visit New Delhi for talks with Modi, with the situation in Kashmir bound to be a talking point with the two leaders looking to come to a compromise. Words have been strong between the two leading up to the meeting- on Wednesday New Delhi said it did not welcome comments on its internal matters in response to a reference to \"relevant\" UN resolutions after Xi's meeting with Pakistan Prime Minister Imran Khan this week.", "article title": "China and India face off in Kashmir as Beijing stamps authority in region", "meta information": {"meta description": "CHINA and India have been contesting ownership of territory in the Ladakh region of Kashmir and now Beijing is forcibly stamping its authority ahead of crunch talks this weekend.", "publish date": "2019-10-10T15:10:00+01:00", "image": "https://cdn.images.express.co.uk/img/dynamic/78/750x445/1189025.jpg", "authors": ["Charlie Bradley"], "meta keywords": "", "url": "https://www.express.co.uk/news/world/1189025/China-news-india-furious-beijing-aggression-kashmir-world-war-3-spt"}}, {"text": "BEIJING (Reuters) - China hopes Beijing and Washington will resolve their trade dispute “with a calm and rational attitude”, Vice Commerce Minister Wang Shouwen said on Sunday, ahead of talks in two weeks between the two sides.\n\nThe United States and China have been locked in an escalating trade war for over a year. They have levied punitive duties on hundreds of billions of dollars of each other’s goods, roiling financial markets and threatening global growth.\n\nA new round of high-level talks between the world’s two largest economies is expected in Washington on Oct. 10-11, led from the Chinese side by President Xi Jinping’s top economic adviser, Vice Premier Liu He.\n\nWang, who has been part of China’s negotiating team with the United States, told a news conference that Liu would go to Washington for the talks the week after China’s National Day holiday, which ends on Oct. 7.\n\nHe said he hoped both sides would find ways to resolve their differences. “We believe this will benefit both countries’ people and the world,” he added.\n\nThe Trump administration is considering radical new financial pressure tactics on Beijing, including the possibility of delisting Chinese companies from U.S. stock exchanges.\n\nSources told Reuters on Friday that the move would be part of a broader effort to limit U.S. investments into Chinese companies, in part because of growing security concerns about their activities.\n\nChina has hit back at U.S. criticisms about lack of market access for U.S. firms, forced technology transfers and poor protection of intellectual property.\n\nWang reiterated that China will open up more sectors of the economy to foreign investors, and its policy of protecting foreign companies’ rights in the country will not change.\n\nEarlier, Commerce Minister Zhong Shan told the news conference in Beijing that Chinese companies faced many difficulties due to the trade frictions which he said posed unprecedented trade challenges to the country.\n\nChina would expand imports, and measures to stabilize trade would yield positive results, he said without giving details.\n\nThe trade war has added to tensions between China and the United States, whose ties are also strained over U.S. criticism of human rights issues in China, including protests in Hong Kong, the disputed South China Sea and U.S. support for Chinese-claimed Taiwan.\n\nThe Chinese government’s top diplomat said on Friday that tariffs and trade disputes could plunge the world into recession and Beijing was committed to resolving them in a “calm, rational and cooperative manner”.\n\nThe dispute has taken its toll on the Chinese economy.\n\nChina’s exports unexpectedly fell in August as shipments to the United States slowed sharply, pointing to further weakness in the world’s second-largest economy and underlining a pressing need for more stimulus.\n\nBeijing is widely expected to announce more support measures in coming months to avert the risk of a sharper economic slowdown as the United States ratchets up trade pressure.", "article title": "China urges 'calm and rational' resolution to -Sino trade war", "meta information": {"meta description": "China hopes Beijing and Washington will resolve their trade dispute \"with a calm and rational attitude\", Vice Commerce Minister Wang Shouwen said on Sunday, ahead of talks in two weeks between the two sides.", "publish date": "2019-09-30T08:45:41+0000", "image": "https://s3.reutersmedia.net/resources/r/?m=02&d=20190929&t=2&i=1435146111&w=1200&r=LYNXMPEF8S076", "authors": ["Min Read", "Ryan Woo"], "meta keywords": "US,USA,TRADE,CHINA,Energy Markets,Agricultural Markets,International Trade,Energy (Legacy),Tariffs,Taxation,Asia / Pacific,Major News,Fishing and Farming (TRBC),Industrials (TRBC),Monetary / Fiscal Policy / Policy Makers,International Agencies / Treaty Groups,United States,Subsidies,Company News,Diplomacy / Foreign Policy,China (PRC),Government / Politics,Technology (TRBC),US Government News,Livestock,Commodities News (3rd Party),Cyclical Consumer Goods and Services (TRBC),Regulation,Emerging Market Countries", "url": "https://www.reuters.com/article/us-usa-trade-china-idUSKBN1WE08L"}}, {"text": "BEIJING (Reuters) - China warned on Monday of instability in international markets from any “decoupling” of China and the United States, after sources said the Trump administration was considering delisting Chinese companies from U.S. stock exchanges.\n\nThe move would be part of a broader effort to limit U.S. investment in Chinese companies, two sources briefed on the matter told Reuters last week, in what would be a radical escalation of U.S.-China trade tensions. The news had earlier been reported by Bloomberg..\n\nA third source said the delisting idea was motivated by growing security concerns within the administration of U.S. President Donald Trump over Chinese companies’ activities.\n\nWhite House trade adviser Peter Navarro on Monday dismissed the reports as “fake news.”\n\n“That story, which appeared in Bloomberg: I’ve read it far more carefully than it was written,” Navarro told CNBC. “Over half of it was highly inaccurate or simply flat-out false.”\n\nShares of U.S.-listed Chinese stocks reversed direction on Monday after a sharp fall on the delisting reports. Alibaba Group Holding Ltd (BABA.N) and JD.Com Inc (JD.O) rose 2% each in early trading after tumbling more than 5% on Friday.\n\nAlso on Monday, e-learning firm Youdao Inc became the latest Chinese company to file for an initial public offering in the United States. Chinese online pharmacy Ecmoho filed to list its shares on the Nasdaq last week.\n\nEcmoho is planning to start pre-marketing next week, IFR reported, citing people familiar with the matter. The company was not immediately available for comment.\n\nEarlier in the day, stocks in China fell to their lowest in almost a month on the reports, which came at a sensitive time ahead of celebrations on Tuesday to mark 70 years since the founding of the People’s Republic of China.\n\nChinese Foreign Ministry spokesman Geng Shuang told a daily news briefing on Monday he had noted the response from the U.S. Treasury, which said there were no plans to block Chinese listings “at this time”.\n\n“Exerting maximum pressure and even seeking the forced decoupling of China-U.S. relations will harm the interests of Chinese and American companies and people, create turmoil in financial markets, and endanger global trade and economic growth,” Geng added.\n\n“This does not accord with the interests of the international community.”\n\nGeng said he hoped that the United States would take a “constructive attitude” toward resolving differences.\n\nThe United States and China have been locked in an escalating trade war for nearly 15 months. They have levied punitive duties on hundreds of billions of dollars of each other’s goods, roiling financial markets and threatening global growth.\n\nIn June, U.S. lawmakers from both parties introduced a bill to force Chinese companies listed on American stock exchanges to submit to regulatory oversight, including providing access to audits, or face delisting.\n\nChinese authorities have long been reluctant to let overseas regulators inspect local accounting firms - including member firms of the Big Four international accounting networks - citing national security concerns.\n\nChina and the United States are due to resume high-level trade talks next week in Washington.\n\nIn advance of the talks, Chinese firms bought up to 600,000 tonnes of U.S. soybeans for shipment from November to January on Monday, two sources with knowledge of the deals said. The purchases form part of a tariff-free quota allotted for up to 2 million tonnes this week. China has frequently made goodwill purchases of U.S. agricultural goods ahead of trade talks.\n\nChina hopes Beijing and Washington will resolve their trade dispute “with a calm and rational attitude”, Vice Commerce Minister Wang Shouwen, who has been part of China’s negotiating team, said on Sunday.", "article title": "On delisting threat, China says 'decoupling' would harm both sides", "meta information": {"meta description": "China warned on Monday of instability in international markets from any \"decoupling\" of China and the United States, after sources said the Trump administration was considering delisting Chinese companies from U.S. stock exchanges.", "publish date": "2019-09-30T22:53:34+0000", "image": "https://s4.reutersmedia.net/resources/r/?m=02&d=20190930&t=2&i=1435459409&w=1200&r=LYNXMPEF8T0EZ", "authors": ["Min Read", "Michael Martina"], "meta keywords": "US,USA,TRADE,CHINA,LIMITS,Company News,International Trade,Initial Public Offerings,Diplomacy / Foreign Policy,China (PRC),Equity Investments,Volatile Shares / Hot Stocks,Government / Politics,Video,Soybean,Asia / Pacific,Market Events,Major News,Equities Markets,US Government News,Pictures,International / National Security,Emerging Market Countries,United States", "url": "https://www.reuters.com/article/us-usa-trade-china-limits-idUSKBN1WF0M5"}}, {"text": "Yolanda Yu, a spokeswoman for the Hong Kong Police Force, said in a video posted on the force’s Facebook page that the protester was an 18-year-old who had been shot in the left shoulder. She said the protester was conscious as he was taken to the hospital.\n\nLocal news media reported that the young man was a high school student.\n\nMs. Yu said the officer who shot the protester had been under attack by violent “rioters” who were threatening officers’ lives. “In order to save himself and his colleagues, he fired one shot at the attacker,” she said.\n\nIn the video, the protester who was shot is first seen joining a black-clad mob of people who chase a riot officer and tackle him to the ground. They kick him and beat him with what appear to be metal pipes.\n\nAt one point, the protester approaches a second police officer who is standing nearby with a handgun drawn. Just after the protester hits the officer with the pipe, the officer fires at the man at point-blank range.\n\nStephen Lo, the Hong Kong police commissioner, told reporters at a late-night news conference that doctors were treating the 18-year-old who had been shot. He said the protester had been arrested and that the authorities would decide later whether to press charges of assaulting a police officer.", "article title": "National Day Demonstrations in Hong Kong Turn Violent", "meta information": {"meta description": "The Hong Kong police used a live round against a protester for the first time in months of protests, as Beijing celebrated 70 years of Communist Party rule.", "publish date": null, "image": "https://static01.nyt.com/images/2019/10/01/world/asia/Sequence-06/Sequence-06-articleLarge.jpg", "authors": ["The New York Times"], "meta keywords": "", "url": "https://www.nytimes.com/2019/09/30/world/asia/china-national-day-hong-kong-protests.html"}}, {"text": "Microsoft broke new ground when it introduced its touchscreen Surface tablet / laptop hybrid back in 2012, and it hasn’t stopped since. This year, the company seems to be pulling out all the stops: its event at the Starrett-Lehigh Building in New York City looks like it will introduce some major innovations.\n\nWhy tune in? Because you can probably expect to see new products and interesting device refreshes for the Surface line. These may include a Surface laptop powered by Qualcomm’s new ARM chip and one that offers dual-screen capabilities. There are also rumors about a new speaker and a consumer version of Teams, Microsoft’s answer to Slack.\n\nWhatever the company plans to announce, we’ll be covering it. You can follow the event via the live stream, and enjoy our live blog where The Verge’s writers will keep things lively with their observations and opinions. It’s all happening today, October 2nd, starting at 10AM ET / 7AM PT. Here are the details:\n\nLive blog: Tune in to The Verge’s live blog for the latest on Microsoft’s event, expert commentary, and photos from the Starrett-Lehigh Building in New York City.\n\nLive stream: Microsoft is live-streaming the event on YouTube or on its website for desktop viewing.\n\nLive tweeting: Follow @verge on Twitter for the highlights and new products introduced at Microsoft’s Surface event.\n\nLive Instagram updates: Keep an eye on @verge on Instagram for live updates from our team.", "article title": "How to watch Microsoft’s 2019 Surface event", "meta information": {"meta description": "We expect to see new products and interesting device refreshes for the Surface line. These may include a Surface laptop powered by Qualcomm’s new ARM chip and one that offers dual-screen capabilities. There are also rumors about a new speaker and a consumer version of Teams, Microsoft’s answer to Slack.", "publish date": "2019-10-02T06:00:00-04:00", "image": "https://cdn.vox-cdn.com/thumbor/WgYrQ-N1-q2Nh1E2i1TPWNJiR84=/0x146:2040x1214/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/13273569/akrales_181012_3019_0072.jpg", "authors": ["Barbara Krasnoff", "Oct Edt"], "meta keywords": "", "url": "https://www.theverge.com/2019/10/2/20881909/microsoft-surface-pro-7-event-watch-live-stream-how-to-time-date"}}, {"text": "BEIJING (Reuters) - China Investment Corp (CIC) reported a 37% dive in annual profit on Friday and said the ongoing Sino-U.S. trade war has made the Chinese sovereign wealth fund more cautious about investing in the United States.\n\nChina and the United States have enmeshed in a tit-for-tat trade war for more than a year that has led to escalating import tariffs at a time of slowing global economic growth.\n\nThe trade war “is making us more cautious about investing in the U.S.,” CIC President Ju Weimin said at a news conference in Beijing after the fund reported its annual earnings.\n\nThe fund “will not pose a threat to the countries it invests in, we insist on legal compliance,” said Ju, adding the wealth fund will reduce the riskiest assets in its portfolio, and seek opportunities in industries such as manufacturing, technology, telecommunications and healthcare.\n\nCIC is a shareholder in China’s largest banks including China Development Bank Corp and Industrial and Commercial Bank of China Ltd (1398.HK) (601398.SS).\n\nIt posted a 37.2% fall in 2018 net profit at $65.06 billion, citing a complex global financial environment and market turmoil. Its total investment income was fell 40.7% to $67.84 billion.\n\n“The global economy and financial situation is complex, international capital markets are in turmoil, the risk for assets is growing,” said Chairman Peng Chun, who described the current Sino-U.S. relationship as “delicate”.\n\nThe fund “feels a lot of pressure,” Peng said, adding CIC’s long-term returns outlook is stable.\n\nCIC booked a minus 2.35% net return on overseas investments last year, versus 17.59% in 2017. However, its annualized accumulative investment return for 2008 to 2018 was 6.07%, exceeding the fund’s performance review target, Peng said.\n\nThe fund has invested in 44 projects worth $26 billion under the government’s Belt and Road international trade route initiative as at the end of August, said Ju.\n\n“Some countries have tightened their investment oversight,” said Peng, adding Chinese investment entities have faced prejudicial treatment due to increased protectionism.\n\nCIC neverthelss plans to actively engage in cross-border investment such as multilateral funds, Peng said.\n\nHeadquartered in Beijing, CIC was founded in 2007 to help China earn a higher return on its foreign exchange reserves. It managed 4.3 trillion yuan ($607.01 billion) worth of state assets as at the end of 2018, its earnings report showed.\n\nDomestically, CIC plans to strengthen its role in the management of state-owned assets, said Peng, and the most important part of that role is to minimize financial risk.\n\nEarlier this year, through CIC unit Central Huijin Investment Ltd, the fund said it will act as a strategic investor in struggling Hengfeng Bank, as part of a state rescue initiative to support highly indebted smaller banks and contain financial risk.\n\nAsked about Central Huijin’s future rescue plans, Peng said: “CIC will step up its role as a platform to resolve and rescue high-risk institutions through market-oriented ways. Resolving financial risks is a new norm and will be a long-term job for us.”\n\nHe said such rescue efforts would not change the market position of Central Huijin.", "article title": "China sovereign fund CIC says cautious of investment amid trade war", "meta information": {"meta description": "China Investment Corp (CIC) reported a 37% dive in annual profit on Friday and said the ongoing Sino-U.S. trade war has made the Chinese sovereign wealth fund more cautious about investing in the United States.", "publish date": "2019-09-20T12:12:14+0000", "image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "authors": ["Min Read", "Cheng Leng"], "meta keywords": "US,CHINA,CIC,Funds,International Trade,Financials (TRBC),Financials (Legacy),China (PRC),Asia / Pacific,Major News,Debt / Fixed Income Markets,Sovereign Wealth Funds,Emerging Market Countries,United States", "url": "https://www.reuters.com/article/us-china-cic-idUSKBN1W50JP"}}, {"text": "WASHINGTON (Reuters) - Chinese officials, led by Vice Premier Liu He, departed the U.S. Trade Representative’s office on Friday, signaling that two days of U.S.-China trade talks had concluded.\n\nLiu is due to meet with U.S. President Donald Trump in the White House at 2:45 p.m. EDT (1845 GMT).\n\nIt was unclear when Liu and the Chinese delegation would return to Beijing. A Chinese official told Reuters that there was concern that he would not be able to make the final Air China flight from Washington’s Dulles Airport to Beijing on Friday at 4:05 p.m. EDT.", "article title": "Chinese delegation departs USTR building as trade talks conclude", "meta information": {"meta description": "Chinese officials, led by Vice Premier Liu He, departed the U.S. Trade Representative's office on Friday, signaling that two days of U.S.-China trade talks had concluded.", "publish date": "2019-10-11T17:38:39+0000", "image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "authors": ["Min Read", "Reuters Editorial"], "meta keywords": "US,USA,TRADE,CHINA,TALKS,Computer and Electronics Retailers (TRBC),Company News,Intellectual Property / Copyright / Counterfeiting,International Trade,Tariffs,Diplomacy / Foreign Policy,China (PRC),Software (TRBC),Industrial Machinery and Equipment (TRBC),Government / Politics,Asia / Pacific,Major News,US Government News,Regulation,United Nations,Economic News (3rd Party),United States", "url": "https://www.reuters.com/article/us-usa-trade-china-talks-idUSKBN1WQ27W"}}, {"text": "STOCKHOLM (Reuters) - A North Korean delegation headed by the country’s chief nuclear negotiator Kim Myong Gil has landed in Stockholm, Sweden for denuclearization talks with the U.S., a source familiar with the matter said on Thursday.\n\nEarlier on Thursday Kim, speaking to Yonhap news agency at Beijing airport, said he and other officials were heading to Sweden.\n\n“We’re going for the DPRK-U.S. working-level negotiations,” Kim told reporters in Beijing, according to Yonhap. “There’s been a new signal from the U.S. side, so we’re going with great expectations and optimism about the outcome.”", "article title": "A North Korean delegation has landed in Sweden for talks with : source", "meta information": {"meta description": "A North Korean delegation headed by the country's chief nuclear negotiator Kim Myong Gil has landed in Stockholm, Sweden for denuclearization talks with the U.S., a source familiar with the matter said on Thursday.", "publish date": "2019-10-03T16:27:19+0000", "image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "authors": ["Min Read", "Reuters Editorial"], "meta keywords": "US,NORTHKOREA,MISSLES,SWEDEN,Americas,Russia,Defense,North Korea,Japan,Western Europe,South Korea,CIS Countries,Diplomacy / Foreign Policy,China (PRC),Government / Politics,Central / Eastern Europe,General News,Sweden,Asia / Pacific,East European Countries,Nuclear Armaments / Nuclear Proliferation,Major News,Military Procurement,Europe,International / National Security,Emerging Market Countries,United States", "url": "https://www.reuters.com/article/us-northkorea-missles-sweden-idUSKBN1WI1VO"}}, {"text": "An activist involved in anti-government protests in Hong Kong has been shot in the chest by police during a clash.\n\nThe incident came as thousands of people demonstrated in defiance of a protest ban for the 70th anniversary of Communist rule in China.\n\nThough people have been shot by rubber bullets in previous protests, this is the first injury from a live round.\n\nIn the Chinese capital Beijing, 15,000 soldiers paraded with advanced military hardware to mark the anniversary.\n\nNearly four months of protests in Hong Kong have challenged Chinese President Xi Jinping's vision of national unity.\n\nEarlier, the Chinese flag was raised at a special ceremony in the territory. Security was tight and the 12,000 invited guests watched the event on a live video feed from inside a conference centre.\n\nOn what is being described by protesters as a \"day of grief\", people took to the streets in central Hong Kong and at least six other districts, blocking roads in some areas.\n\nAt least 66 people were injured during the clashes, as police fired tear gas and protesters threw petrol bombs. Two people were in a critical condition and two others were seriously injured, the Hospital Authority said.\n\nAccording to local media, at least 180 people were arrested.\n\nThe man, who is aged 18, has been undergoing surgery and his condition is not known. Police say he was hit \"near his left shoulder\".\n\nA video shows the injured man lying on the ground, saying: \"Send me to hospital. My chest is hurting, I need to go to hospital.\"\n\nVideo of the shooting shows a police officer opening fire with a revolver at a man swinging what appears to be a metal pole, as a group of protesters confront riot police.\n\nPolice say their officers were attacked and the policeman who opened fire did so as he \"felt his life was under serious threat\".\n\n\"He fired a round at the assailant to save his own life and his colleagues' lives,\" Senior Supt Yolanda Yu Hoi-kwan was quoted as saying by the South China Morning Post.\n\nInvestigations will be conducted into the shooting and an allegation of assault against the young man, police chief Stephen Lo was quoted as saying by the South China Morning Post.\n\nIn addition to the bullet fired at the young man, five other live rounds were fired at various locations on Tuesday, police say.\n\n\"Our national day is supposed to be a day to celebrate and be happy,\" said the police chief.\n\n\"But unfortunately some rioters chose to do all this all these sorts of criminal damages, arsons, wounding, assaulting police officers, and various [other] behaviours. Which are more or less equivalent to a riot offence.\"\n\nUK Foreign Secretary Dominic Raab called for restraint and de-escalation in the former British territory, saying: \"Whilst there is no excuse for violence, the use of live ammunition is disproportionate and only risks inflaming the situation.\"\n\nPolice tried to disperse the protesters - some of whom were armed with petrol bombs, projectiles or poles - with tear gas, rubber bullets and water cannon, the latter spraying blue dye to make it easier to identify them later.\n\nIn response to heavy-handed policing, some protesters have become increasingly confrontational, BBC Newsnight international editor Gabriel Gatehouse reports from Hong Kong.\n\n\"If I get shot in the head and I die, it's okay,\" one radical told him. \"This might raise the awareness of society.\"\n\nAt least 15 metro stations and numerous shopping centres in the city were closed, and some 6,000 officers were deployed in the territory.\n\nProtests in Hong Kong by now follow a familiar rhythm - peaceful mass marches which then slide into violence. What stood out today however was the swiftness with which the violence exploded.\n\nAcross many parts of Hong Kong, protesters fought pitched battles with police, with one clash culminating in a young man getting shot by a live round. Authorities appeared to show a new determination to put down the protests as quickly as possible on China's National Day, perhaps to save face, but it inevitably only angered the protesters even more.\n\nOn the streets of Hong Kong Island's dense downtown, from Admiralty to Causeway Bay, protesters played cat and mouse with police, setting a trail of fires in their wake. Police relentlessly attempted to box them in by sending water cannon and elite forces down main roads, while smaller teams charged up side streets.\n\nBut at times the tactics on both sides made little sense and threatened to spin out of control. Petrol and smoke bombs alike were sometimes hurled inexpertly, seriously endangering reporters and passers-by.\n\nIn Admiralty, I saw protesters armed just with umbrellas repeatedly attempting to charge up an escalator to an overhead bridge where riot police were stationed. After shouting warnings, police let loose a barrage of tear gas directly at the protesters, shot at extremely close range. Then in Wan Chai, protesters decided to set a bonfire right in front of a petrol station that was sandwiched between residential blocks - it was quickly put out.\n\nDusk settled; the mayhem continued. I'd started the day with a peaceful, festive mass march that began in Causeway Bay, and hours later found myself right back where I'd started, this time dodging fires and running from police, following that Hong Kong protest rhythm to its inevitable bitter end.\n\nHong Kong has been a part of China since 1997 but has its own system of law and government - known as One Country Two Systems.\n\nIn recent years, there has been increasing opposition to what has been seen as the growing influence of Beijing on Hong Kong's society and politics.\n\nHong Kong always sees anti-Beijing protests on 1 October, and this year they were expected to be larger than ever, because of the months of unrest triggered by proposed changes to the extradition law.\n\nThe changes would have made it possible for China to extradite people to the mainland from Hong Kong, something opponents felt put Hong Kongers at risk of persecution in unfair trials.\n\nFor nearly four months, protesters have taken to the streets - at times reported to be in the millions.\n\nThe proposed changes to the extradition law have officially been scrapped but that has failed to quell the unrest, which has now evolved into an existential battle over Hong Kong's future.\n\nSpeaking from a podium in Beijing's Tiananmen Square, President Xi said no force could stop China's onward march.\n\nDressed in a Mao suit, he watched the parade which featured some military hardware on show for the first time.\n\nThe highly choreographed event presented an image of national unity and gave no hint at the difficulties faced by China's Communist leaders during the last seven decades, or their current problems.", "article title": "Activist shot amid Hong Kong protests", "meta information": {"meta description": "Police hit a protester in the chest, in the first live round shooting in months of unrest.", "publish date": null, "image": "https://ichef.bbci.co.uk/images/ic/720x405/p07l0fpz.jpg", "authors": [], "meta keywords": "", "url": "https://www.bbc.co.uk/news/world-asia-china-49891403"}}, {"text": "About Your Privacy on this Site\n\nWelcome! Time collects data to deliver the best content, services, and personalized digital ads. We partner with third party advertisers, who may use tracking technologies to collect information about your activity on sites and applications across devices, both on our sites and across the Internet.\n\nYou always have the choice to experience our sites without personalized advertising based on your web browsing activity by visiting the DAA’s Consumer Choice page, the NAI's website, and/or the EU online choices page, from each of your browsers or devices. To avoid personalized advertising based on your mobile app activity, you can install the DAA’s AppChoices app here. You can find much more information about your privacy choices in our privacy policy. You can make a Data Subject Request at any time.Even if you choose not to have your activity tracked by third parties for advertising services, you will still see non-personalized ads on our site.\n\nBy clicking continue below and using our sites or applications, you agree that we and our third party advertisers can:", "article title": "https://time.com", "meta information": {"meta description": "Breaking news and analysis from TIME.com. Politics, world news, photos, video, tech reviews, health, science and entertainment news.", "publish date": null, "image": "http://time.com/img/misc/og-default.png", "authors": [], "meta keywords": "Time, News, Sports, Lifestyle, Entertainment", "url": "https://time.com/5695823/china-nba-houston-rockets-basketball/"}}]}