{"text": "An activist involved in anti-government protests in Hong Kong has been shot in the chest by police during a clash.\n\nThe incident came as thousands of people demonstrated in defiance of a protest ban for the 70th anniversary of Communist rule in China.\n\nThough people have been shot by rubber bullets in previous protests, this is the first injury from a live round.\n\nIn the Chinese capital Beijing, 15,000 soldiers paraded with advanced military hardware to mark the anniversary.\n\nNearly four months of protests in Hong Kong have challenged Chinese President Xi Jinping's vision of national unity.\n\nEarlier, the Chinese flag was raised at a special ceremony in the territory. Security was tight and the 12,000 invited guests watched the event on a live video feed from inside a conference centre.\n\nOn what is being described by protesters as a \"day of grief\", people took to the streets in central Hong Kong and at least six other districts, blocking roads in some areas.\n\nAt least 66 people were injured during the clashes, as police fired tear gas and protesters threw petrol bombs. Two people were in a critical condition and two others were seriously injured, the Hospital Authority said.\n\nAccording to local media, at least 180 people were arrested.\n\nThe man, who is aged 18, has been undergoing surgery and his condition is not known. Police say he was hit \"near his left shoulder\".\n\nA video shows the injured man lying on the ground, saying: \"Send me to hospital. My chest is hurting, I need to go to hospital.\"\n\nVideo of the shooting shows a police officer opening fire with a revolver at a man swinging what appears to be a metal pole, as a group of protesters confront riot police.\n\nPolice say their officers were attacked and the policeman who opened fire did so as he \"felt his life was under serious threat\".\n\n\"He fired a round at the assailant to save his own life and his colleagues' lives,\" Senior Supt Yolanda Yu Hoi-kwan was quoted as saying by the South China Morning Post.\n\nInvestigations will be conducted into the shooting and an allegation of assault against the young man, police chief Stephen Lo was quoted as saying by the South China Morning Post.\n\nIn addition to the bullet fired at the young man, five other live rounds were fired at various locations on Tuesday, police say.\n\n\"Our national day is supposed to be a day to celebrate and be happy,\" said the police chief.\n\n\"But unfortunately some rioters chose to do all this all these sorts of criminal damages, arsons, wounding, assaulting police officers, and various [other] behaviours. Which are more or less equivalent to a riot offence.\"\n\nUK Foreign Secretary Dominic Raab called for restraint and de-escalation in the former British territory, saying: \"Whilst there is no excuse for violence, the use of live ammunition is disproportionate and only risks inflaming the situation.\"\n\nPolice tried to disperse the protesters - some of whom were armed with petrol bombs, projectiles or poles - with tear gas, rubber bullets and water cannon, the latter spraying blue dye to make it easier to identify them later.\n\nIn response to heavy-handed policing, some protesters have become increasingly confrontational, BBC Newsnight international editor Gabriel Gatehouse reports from Hong Kong.\n\n\"If I get shot in the head and I die, it's okay,\" one radical told him. \"This might raise the awareness of society.\"\n\nAt least 15 metro stations and numerous shopping centres in the city were closed, and some 6,000 officers were deployed in the territory.\n\nProtests in Hong Kong by now follow a familiar rhythm - peaceful mass marches which then slide into violence. What stood out today however was the swiftness with which the violence exploded.\n\nAcross many parts of Hong Kong, protesters fought pitched battles with police, with one clash culminating in a young man getting shot by a live round. Authorities appeared to show a new determination to put down the protests as quickly as possible on China's National Day, perhaps to save face, but it inevitably only angered the protesters even more.\n\nOn the streets of Hong Kong Island's dense downtown, from Admiralty to Causeway Bay, protesters played cat and mouse with police, setting a trail of fires in their wake. Police relentlessly attempted to box them in by sending water cannon and elite forces down main roads, while smaller teams charged up side streets.\n\nBut at times the tactics on both sides made little sense and threatened to spin out of control. Petrol and smoke bombs alike were sometimes hurled inexpertly, seriously endangering reporters and passers-by.\n\nIn Admiralty, I saw protesters armed just with umbrellas repeatedly attempting to charge up an escalator to an overhead bridge where riot police were stationed. After shouting warnings, police let loose a barrage of tear gas directly at the protesters, shot at extremely close range. Then in Wan Chai, protesters decided to set a bonfire right in front of a petrol station that was sandwiched between residential blocks - it was quickly put out.\n\nDusk settled; the mayhem continued. I'd started the day with a peaceful, festive mass march that began in Causeway Bay, and hours later found myself right back where I'd started, this time dodging fires and running from police, following that Hong Kong protest rhythm to its inevitable bitter end.\n\nHong Kong has been a part of China since 1997 but has its own system of law and government - known as One Country Two Systems.\n\nIn recent years, there has been increasing opposition to what has been seen as the growing influence of Beijing on Hong Kong's society and politics.\n\nHong Kong always sees anti-Beijing protests on 1 October, and this year they were expected to be larger than ever, because of the months of unrest triggered by proposed changes to the extradition law.\n\nThe changes would have made it possible for China to extradite people to the mainland from Hong Kong, something opponents felt put Hong Kongers at risk of persecution in unfair trials.\n\nFor nearly four months, protesters have taken to the streets - at times reported to be in the millions.\n\nThe proposed changes to the extradition law have officially been scrapped but that has failed to quell the unrest, which has now evolved into an existential battle over Hong Kong's future.\n\nSpeaking from a podium in Beijing's Tiananmen Square, President Xi said no force could stop China's onward march.\n\nDressed in a Mao suit, he watched the parade which featured some military hardware on show for the first time.\n\nThe highly choreographed event presented an image of national unity and gave no hint at the difficulties faced by China's Communist leaders during the last seven decades, or their current problems.", "article title": "Activist shot amid Hong Kong protests", "meta information": {"meta description": "Police hit a protester in the chest, in the first live round shooting in months of unrest.", "publish date": null, "image": "https://ichef.bbci.co.uk/images/ic/720x405/p07l0fpz.jpg", "authors": [], "meta keywords": ""}}