{"text": "HONG KONG (Reuters) - The publisher of Hong Kong’s Apple Daily controlled by pro-democracy tycoon and Beijing critic Jimmy Lai on Wednesday condemned an assault on one of its reporters by unknown assailants at a restaurant.\n\nThe female reporter has been covering anti-government protests that have plunged the former British colony into its biggest political crisis in decades and posing a direct challenge to the central government in Beijing.\n\nThe journalist was attacked at a restaurant on Tuesday night by four men dressed in black and wearing the protesters’ trademark yellow helmets and masks, Apple Daily reported.\n\nThe reporter was taken to hospital, the newspaper said, but it gave no details on her condition.\n\nPublisher Cheung Kim-hung said the newspaper “has no fear of violence and will continue to defend freedom of the press and the public’s right to know”.\n\nThe Hong Kong Journalists’ Association condemned the attack, which police said was under investigation.\n\nThe incident follows an assault on democratic lawmaker Roy Kwong, who was taken to hospital on Tuesday after being punched and kicked by three men in the Tin Shui Wai district close to the border with mainland China.\n\nFellow Democratic Party lawmaker Lam Cheuk-ting said the assailants had suspected links to triads, organised criminal gangs, and the attacks were intended “to send a message to threaten all” pro-democracy lawmakers.\n\nDemonstrators are frustrated at what they see as Beijing’s tightening grip over the city, which returned to China in 1997 under a “one country, two systems” formula intended to guarantee freedoms not enjoyed on the mainland.\n\nChina has said it is committed to the arrangement and has repeatedly warned foreign countries not to interfere in an “internal affair”.\n\nSpeaking at the U.N. General Assembly in New York, U.S. President Donald Trump drew a link between resolving the U.S.-China trade dispute and Beijing’s treatment of Hong Kong.\n\nTrump said Washington was “carefully monitoring the situation in Hong Kong”.\n\n“How China chooses to handle the situation will say a great deal about its role in the world in the future. We are all counting on President Xi as a great leader,” he said, referring to his Chinese counterpart Xi Jinping.", "article title": "Apple Daily condemns attack on reporter covering Hong Kong protests", "meta information": {"meta description": "The publisher of Hong Kong's Apple Daily controlled by pro-democracy tycoon and Beijing critic Jimmy Lai on Wednesday condemned an assault on one of its reporters by unknown assailants at a restaurant.", "publish date": "2019-09-25T02:35:21+0000", "image": "https://s1.reutersmedia.net/resources/r/?m=02&d=20190925&t=2&i=1433583244&w=1200&r=LYNXMPEF8O051", "authors": ["Min Read", "Reuters Editorial"], "meta keywords": "US,HONGKONG,PROTESTS,ASSAULT,Crime / Law / Justice,Advocacy Groups / Pressure Groups / Lobbies,Hong Kong,Judicial Process / Court Cases / Court Decisions,Media and Publishing (TRBC),Crime,Transportation (TRBC),Video,Asia / Pacific,Major News,Human Rights / Civil Rights,Pictures,Media / Publishing (Legacy),Conflicts / War / Peace,Society / Social Issues,Company News,Diplomacy / Foreign Policy,China (PRC),Government / Politics,Publishing (TRBC),Fundamental Rights / Civil Liberties,General News,Emerging Market Countries,Civil Unrest"}}