{"text": "BEIJING - Beijing's new futuristic airport that resembles a giant starfish -- opened days before the country celebrates the 70th anniversary of communist rule -- promises to transform the Chinese capital into a major Asian aviation hub.\n\nLocated 46 kilometers (29 miles) south of Tiananmen Square, Beijing Daxing International Airport will be able to handle 45 million passengers by 2021, with plans for 72 million by 2025 and 100 million by 2040.\n\nIt was opened by President Xi Jinping Wednesday, but had an immediate hitch when its maiden commercial flight -- an A380 superjumbo heading to the southern city of Guangzhou -- was delayed by nearly 30 minutes.\n\nAbout a decade ago, Daxing was a sleepy suburb of dusty farmland and cramped quarters home to migrant workers building roads and skyscrapers in the city.\n\nNow -- with the airport code PKX -- Daxing is seen as an embodiment of the \"Chinese dream\" Xi has offered his fellow citizens.\n\nAt 700,000 square meters (173 acres) -- about the size of 100 football pitches -- the new structure will be one of the world's largest airport terminals.\n\nSo far only China United Airlines has shifted their operations to the new hub but operations manager Wang Qiang said another seven domestic and eight international airlines would arrive in the \"near future.\"\n\nBritish Airways, Cathay Pacific and Finnair have already announced new routes to tap into its potential.\n\nThe SkyTeam alliance -- which includes Delta, Air France and Dutch airline KLM -- was also expected to move, along with local partners Eastern Airlines and China Southern Airlines.\n\nThe building was designed by Iraqi-British architect Zaha Hadid, who died in 2016.\n\nThe central atrium, with curves like a rolling landscape, is supported by eight giant columns and skylights filling the terminals with natural light.\n\nRelatives and friends can also watch as their loved ones proceed to boarding gates through a viewing gallery.\n\nAn underground train station and metro line will allow travelers to reach Beijing city within 20 to 30 minutes.\n\nThe project cost 120 billion yuan ($17.5 billion), or 400 billion yuan if rail and road links are included.\n\nAt full capacity, Daxing would be the world's largest single terminal in terms of traveler capacity, according to its designers.\n\nDozens of self check-in counters -- where travelers only need to scan their passports -- have been set up alongside conventional airline counters to speed up operations.\n\nTraveller Xie Hangyu said the check-in procedures were \"very smooth and very convenient.\"\n\nThe current Beijing Capital International Airport -- the world's second-largest -- is already overflowing, handling 100 million passengers last year.\n\nWith the opening of Daxing, Beijing joins a select group of cities, including Tokyo, London, Paris and New York, that have two long-haul international airports.\n\nAir transport is booming in China as living standards increase along with peoples' desire to travel.\n\nIt is expected to surpass the US to become the world's biggest aviation market by the mid-2020s, according to the International Air Transport Association.\n\nBy 2037 the country will have 1.6 billion plane journeys each year -- a billion more than in 2017, the organization estimates.", "article title": "Beijing hopes glitzy new airport will take off as aviation hub", "meta information": {"meta description": "Beijing's new futuristic airport that resembles a giant starfish -- opened days before the country celebrates the 70th anniversary of communist rule -- promises to transform the Chinese capital into a major Asian aviation hub.", "publish date": null, "image": "https://sa.kapamilya.com/absnews/abscbnnews/media/2019/reuters/09/29/china.jpg", "authors": [""], "meta keywords": "China, Beijing, Beijing Daxing International Airport, travel, aviation, Beijing hopes glitzy new airport will take off as aviation hub | ABS-CBN News"}}