{"text": "China voiced support Monday for negotiations between the US and Taliban after Chinese officials met the Afghan militants in Beijing, two weeks after US President Donald Trump called off talks on a proposed deal with the insurgents.\n\nForeign ministry spokesman Geng Shuang said China \"hopes that the United States and the Afghan Taliban will maintain the momentum of negotiations\".\n\nGeng also said Beijing \"supports the internal dialogue and negotiations among the Afghans in order to achieve national reconciliation, peace and stability at an early date\".\n\nThe Taliban said in a tweet that Beijing officials had supported the proposed US-Taliban deal, which could have seen Washington begin withdrawing troops.\n\nTrump called off talks earlier this month following the death of an American soldier in a bomb blast in Kabul.\n\nThe Taliban's chief negotiator has since said the group's \"doors are open\" to resuming dialogue.\n\nSuhail Shaheen, spokesman for the Taliban's political office in Qatar, tweeted that a nine-member delegation led by Mullah Abdul Ghani Baradar -- the group's top political leader -- had met with Chinese special envoy for Afghanistan Deng Xijun, and his delegation in Beijing.\n\nAccording to Shaheen, the two sides discussed the US-Taliban negotiations and the agreement, and the Chinese special envoy said the US-Taliban deal is \"a good framework for the solution of Afghan issues and they support it\".\n\n\"We have begun the talks for resolving the Afghan issues and to reach an agreement with the US, and if the US President cannot stay committed to his words and breaks his promise, then he will be held responsible for any destruction and bloodshed in Afghanistan,\" Shaheen tweeted.\n\nIn recent weeks there have been several violent attacks in Afghanistan, which is also gearing up for a presidential election.", "article title": "Beijing gives support to US-Taliban talks", "meta information": {"meta description": "China voiced support Monday for negotiations between the US and Taliban after Chinese officials met the Afghan militants in Beijing, two weeks after US President Donald Trump called off talks on a proposed deal with the insurgents.  Foreign ministry spokesman Geng Shuang said China &quot;hopes that the", "publish date": "2019-09-23T09:57:00.000Z", "image": "768", "authors": ["AFP"], "meta keywords": ""}}