{"text": "A sports needle-mover in the truest sense, Canadian tennis star Bianca Andreescu has enjoyed a stunning rise on the WTA Tour.\n\nThe country and the world have joined her for the ride.\n\nAndreescu's ranking has risen exponentially in her breakout 2019 season. The television ratings have also been huge and the massive increase to her social media following is just as eye-popping.\n\n\"The rise has been tremendous but it's also been sustainable and consistent,\" said Tom Mayenknecht, a Vancouver-based marketing communications executive and sport business commentator.\n\nAndreescu's Instagram account had a modest 12,600 followers at the end of 2018, when she was ranked No. 152 in the world and still looking for her first WTA title.\n\nThe 19-year-old native of Mississauga, Ont., added 58,000 followers in the month of March after her breakthrough win at the BNP Paribas Open in Indian Wells, Calif. Her Rogers Cup crown last month in Toronto helped boost her follower total to over 197,000. Andreescu's recent U.S. Open title and the media blitz that followed rocketed that number to 644,000 and counting.\n\nMike Naraine, an assistant professor with Brock University's department of sport management, said Andreescu has picked her spots nicely with social media posts, helping her build a strong brand with a growing base of supporters.\n\n\"It allows her to draw upon a new base of partners,\" Naraine said from Melbourne in a recent interview. \"They look at her and say, 'Wow, there is this new demographic that's young, that's hip, that's very active in the sports community. We can leverage her visibility as a strong Canadian female star to develop our product.\"'\n\nAndreescu already has anchor sponsors in Nike, BMW, Head and Rogers. A spokesman for the Octagon sports and entertainment agency said Andreescu is expected to make announcements on two new major sponsors over the coming weeks.\n\n\"It's a great journey so far but hopefully only the beginning,\" her agent, Jonathan Dasnieres de Veigy, said from Paris.\n\nCurrently ranked fifth in the world, Andreescu will soon return to action at the China Open in Beijing. The US$8.29-million Premier Mandatory-level event begins Saturday and runs through Oct. 6. Andreescu will face world No. 51 Aliaksandra Sasnovich of Belarus in the first round.\n\nIt will be her first tournament since defeating Serena Williams in the U.S. Open final three weeks ago, a win that sent her into another stratosphere. She pocketed a cool US$3.85 million for the win at the final Grand Slam of the season in New York and made high-profile television appearances on \"The View,\" \"The Tonight Show\" and \"Good Morning America\" among others.\n\n\"I'm just visualizing some of the talk-show interviews that she did and the way she handled herself, it made her real to people and accessible to people,\" Mayenknecht said. \"That's what makes her so popular.\"\n\nAndreescu seems just as natural, comfortable and grounded as a Grand Slam champion as she did nine months ago when she was battling through qualifying draws and playing lower-tier tournaments.\n\n\"She's well poised,\" Naraine said. \"It's almost as if she's been training for this her whole life. We don't necessarily see that with a lot of youth athletes.\"\n\nDasnieres de Veigy credits the \"full team\" around Andreescu that keeps her focused.\n\n\"We really want to be careful on that,\" he said. \"Our vision is very long-term. We truly believe that it was not a one-time thing but just the first step of maybe a long career. That's what we really want for her.\"\n\nAndreescu had a modest 4,000 followers on Twitter at the start of the year. That total rose over tenfold by the Rogers Cup in August and is now pushing 190,000.\n\nShe has the most mentioned Canadian athlete account of 2019, ahead of NBA prospect R.J. Barrett at No. 2 and NHL player Brad Marchand at No. 3.\n\n\"Very few Canadian athletes have ever seen such a surge in Twitter conversation within a calendar year,\" Twitter Canada communications head Cam Gordon said in an email.\n\nThe television ratings for Andreescu's 6-3, 7-5 win over Williams were off the charts. Numeris data showed an average audience of 3.4 million viewers watched the match, making it the most-watched tennis broadcast ever on TSN and RDS.\n\nThe audience peaked at 5.3 million viewers for match point, or about one in seven Canadians. ESPN also enjoyed record ratings in the United States.\n\nDAZN Canada, a streaming service, will reap the benefits of Andreescu's immediate return to the hardcourt. It is the domestic rightsholder for the China Open, although many matches will be played in the wee hours across North America.\n\nTSN has the rights to the four Grand Slams and select ATP Tour events while Sportsnet has the Rogers Cup, Davis Cup and Fed Cup. DAZN Canada has had the WTA Tour and ATP 250 tournaments on its lineup since the platform's domestic launch in July 2017.\n\nAndreescu's next set of goals includes cracking the top three in the world rankings and qualifying for the Oct. 27-Nov. 3 WTA Finals in Shenzhen, China.\n\n\"She's going to be under more and more scrutiny moving forward but there's every indication that she's got the sustainability of being a growing force for a long time,\" said Mayenknecht, a former director of communications and public relations for Tennis Canada. \"If that happens, she's only going to continue to convert a lot of fans.\"\n\nThis report by The Canadian Press was first published Sept. 27, 2019.", "article title": "Bianca Boom: Canadian tennis star Andreescu moves the needle in a big way", "meta information": {"meta description": "A sports needle-mover in the truest sense, Canadian tennis star Bianca Andreescu has enjoyed a stunning rise on the WTA Tour.", "publish date": "2019-09-27T11:26:00-04:00", "image": "https://www.ctvnews.ca/polopoly_fs/1.4613431.1569597917!/httpImage/image.jpg_gen/derivatives/landscape_620/image.jpg", "authors": ["Gregory Strong"], "meta keywords": ""}}