{"text": "China is hosting lavish events to mark 70 years since the founding of the People's Republic of China (PRC).\n\nOn 1 October 1949, Mao Zedong - or Chairman Mao - announced the formation of the PRC, after communist forces won a bloody civil war.\n\nModern China has since developed at an extraordinary pace, but it has also one of the world's most restrictive states.\n\nBut the celebrations were overshadowed as thousands took to Hong Kong streets, with some violent clashes breaking out.\n\nPolice fired tear gas and made arrests as people blocked roads, as they protested against what they say is increasing control by Beijing over the territory's society and politics.\n\nPresident Xi Jinping said \"no force\" could shake China as he oversaw a huge military parade in Tiananmen Square.\n\n\"No force can ever stop the Chinese people and nation from marching forward,\" said the Chinese leader in a brief opening address.\n\nAccording to the Ministry of National Defence, around 15,000 military personnel, 580 pieces of military equipment and 160 aircraft made an appearance at the parade.\n\nThe nation's newest military technology was on full display - military tanks, helicopters and even the DF-41 -China's new intercontinental ballistic missile - was spotted.\n\nAn echelon of planes in a \"70\" formation held a fly past.\n\nThe military parade is now followed by what officials are calling a \"happy and lively show\" involving about 100,000 civilian performers on floats, from farmers and teachers to doctors and students.\n\nLater in the evening, a gala performance will be held in the square.\n\nThe events are open to officials, select members and invited foreign dignitaries only, but will be watched by hundreds of millions of people around the country.\n\nSecurity has been high in central Beijing for weeks - there are strict controls on flying kites or drones around the parade area. Even racing pigeons have been banned.\n\nMedia censorship - always stringent in China - has been tightened even further, with broadcasters given a set list of programmes to play and internet censors removing any online criticism of the Communist Party or its leaders.\n\nProtests are taking place across several districts of the city.\n\nDemonstrators have begun gathering on main roads in downtown Hong Kong, and clashes have already broken out between police and protesters in four districts, according to the South China Morning Post.\n\nIn Wong Tai Sin, police fired tear gas to disperse crowds that had blocked roads. Some protesters were seen throwing paving stones at a police van.\n\nThere were also reports of petrol bombs thrown at riot police.\n\nPolice had earlier said they received credible intelligence that activists were planning a major violent escalation in the city, setting fire to shops and railway stations.\n\nAt least 15 metro stations and numerous shopping centres in the city have been closed, and some 6,000 officers have been deployed in the territory.\n\nAn annual fireworks display had previously been cancelled.\n\nHong Kong leader Carrie Lam is attending the festivities in Beijing.\n\nHong Kong has been a part of China since 1997 but has its own system of law and government - known as One Country Two Systems.\n\nIn a speech given on the eve of the 70th anniversary celebrations, President Xi promised to \"fully and faithfully implement\" the principles of this system.\n\nBut in recent years, there has been increasing opposition to what has been seen as the growing influence of Beijing on Hong Kong's society and politics.\n\nHong Kong always sees anti-Beijing protests on 1 October, and this year they are expected to be larger than ever, because of the months of unrest triggered by proposed changes to the extradition law.\n\nThe changes would have made it possible for China to extradite people to the mainland from Hong Kong, something opponents felt put Hong Kongers at risk of persecution in unfair trials.\n\nFor nearly four months, protesters have taken to the streets - at times in the millions.\n\nThe proposed changes to the extradition law have officially been scrapped but that has failed to quell the unrest which has now evolved into an existential battle over Hong Kong's future.\n\nThe protesters are now demanding full democracy for the territory and for police to be held accountable over the use of force, among other issues.\n\nStanding in the exact spot where Mao declared the foundation of the People's Republic of China, Xi Jinping was the only one among the country's senior leaders wearing the Mao-like suit.\n\nPresident Xi made absolutely no secret of his desire to evoke memories of the country's revolutionary founding father.\n\nHis brief speech touched on familiar themes: unity, on-going struggle, China's inexorable progress.\n\nThen he was carried along, standing, in a car for a lengthy review of the military parade. He waved occasionally, they replied with shouts of loyalty.\n\nMilitary leaders have said this isn't \"muscle flexing\" but note that this key moment, this celebration of 70 years of communist control, is focused overwhelmingly on military might.\n\nSeventy years ago, Chairman Mao announced the birth of the PRC after the Communist Party of China defeated the ruling Kuomintang (KMT) - or National Party.\n\nThe two sides had been locked in a costly civil war since the 1920s, after the collapse of the imperial system.\n\nThe events would show that China had \"stood up, grown rich and become stronger over the past decades\", officials said.\n\n\"The main theme is to tell Chinese stories and express the Chinese people's confidence in the party and the country,\" said Zhang Ge, one of the officials responsible for the anniversary celebrations.\n\nChina has said it is developing an entirely new political system - \"socialism with Chinese characteristics\" - and that it has raised millions out of poverty.\n\nTo its critics, though, China is a deeply oppressive country turning back progress on global human rights. It has been widely criticised for its lack of democracy, suppression of rights and any sign of dissent, an unfair justice system with a 99% conviction rate, and in recent years the mass detention of ethnic Uighur Muslims in Xinjiang, among other groups.", "article title": "China celebrates 70 years of Communist Party rule", "meta information": {"meta description": "A huge parade is taking place in Beijing, but risks being overshadowed by unrest in Hong Kong.", "publish date": null, "image": "https://ichef.bbci.co.uk/images/ic/720x405/p07pvzj1.jpg", "authors": [], "meta keywords": ""}}