{"text": "BEIJING (Reuters) - China hopes Beijing and Washington will resolve their trade dispute “with a calm and rational attitude”, Vice Commerce Minister Wang Shouwen said on Sunday, ahead of talks in two weeks between the two sides.\n\nThe United States and China have been locked in an escalating trade war for over a year. They have levied punitive duties on hundreds of billions of dollars of each other’s goods, roiling financial markets and threatening global growth.\n\nA new round of high-level talks between the world’s two largest economies is expected in Washington on Oct. 10-11, led from the Chinese side by President Xi Jinping’s top economic adviser, Vice Premier Liu He.\n\nWang, who has been part of China’s negotiating team with the United States, told a news conference that Liu would go to Washington for the talks the week after China’s National Day holiday, which ends on Oct. 7.\n\nHe said he hoped both sides would find ways to resolve their differences. “We believe this will benefit both countries’ people and the world,” he added.\n\nThe Trump administration is considering radical new financial pressure tactics on Beijing, including the possibility of delisting Chinese companies from U.S. stock exchanges.\n\nSources told Reuters on Friday that the move would be part of a broader effort to limit U.S. investments into Chinese companies, in part because of growing security concerns about their activities.\n\nChina has hit back at U.S. criticisms about lack of market access for U.S. firms, forced technology transfers and poor protection of intellectual property.\n\nWang reiterated that China will open up more sectors of the economy to foreign investors, and its policy of protecting foreign companies’ rights in the country will not change.\n\nEarlier, Commerce Minister Zhong Shan told the news conference in Beijing that Chinese companies faced many difficulties due to the trade frictions which he said posed unprecedented trade challenges to the country.\n\nChina would expand imports, and measures to stabilize trade would yield positive results, he said without giving details.\n\nThe trade war has added to tensions between China and the United States, whose ties are also strained over U.S. criticism of human rights issues in China, including protests in Hong Kong, the disputed South China Sea and U.S. support for Chinese-claimed Taiwan.\n\nThe Chinese government’s top diplomat said on Friday that tariffs and trade disputes could plunge the world into recession and Beijing was committed to resolving them in a “calm, rational and cooperative manner”.\n\nThe dispute has taken its toll on the Chinese economy.\n\nChina’s exports unexpectedly fell in August as shipments to the United States slowed sharply, pointing to further weakness in the world’s second-largest economy and underlining a pressing need for more stimulus.\n\nBeijing is widely expected to announce more support measures in coming months to avert the risk of a sharper economic slowdown as the United States ratchets up trade pressure.", "article title": "China urges 'calm and rational' resolution to -Sino trade war", "meta information": {"meta description": "China hopes Beijing and Washington will resolve their trade dispute \"with a calm and rational attitude\", Vice Commerce Minister Wang Shouwen said on Sunday, ahead of talks in two weeks between the two sides.", "publish date": "2019-09-30T08:45:41+0000", "image": "https://s3.reutersmedia.net/resources/r/?m=02&d=20190929&t=2&i=1435146111&w=1200&r=LYNXMPEF8S076", "authors": ["Min Read", "Ryan Woo"], "meta keywords": "US,USA,TRADE,CHINA,Energy Markets,Agricultural Markets,International Trade,Energy (Legacy),Tariffs,Taxation,Asia / Pacific,Major News,Fishing and Farming (TRBC),Industrials (TRBC),Monetary / Fiscal Policy / Policy Makers,International Agencies / Treaty Groups,United States,Subsidies,Company News,Diplomacy / Foreign Policy,China (PRC),Government / Politics,Technology (TRBC),US Government News,Livestock,Commodities News (3rd Party),Cyclical Consumer Goods and Services (TRBC),Regulation,Emerging Market Countries"}}