{"text": "Ladakh is a remote and picturesque part of the region that borders China. It is further divided administratively into the Leh district, which is predominantly Buddhist, and the Kargil district, which is mostly Muslim. There have been occasional border skirmishes between India and China. On October 31, New Delhi will seize control of the region raising fears about the future in both the Buddhist and Muslim communities, although so far the tensions have been confined to cultural and political differences, without violence. However, India and China have a long history of tension in the Ladakh and Doklam regions where border disputes have led to skirmishes as recently as last month. In 1962, a war between New Delhi and Beijing was sparked in the Kashmir region spilling into Ladakh, with conflict engulfing the Himalayan territory for a month.\n\nBut the tensions have not faded since then, with ongoing disputes provoking sporadic spikes in military gesturing. In 2017, a standoff occurred at the Doklam border as India resisted a road being built in the region by China, and earlier this month, Chinese and Indian military clashed again when the Chinese People's Liberation Army objected to Indian patrols in Ladakh. Now, unease in Ladakh could be on the horizon with divides between Buddhist and Muslim communities looming. Muslim residents want to remain tied to the Kashmir Valley while Buddhists celebrate the prospect of Indian Prime Minister Narendra Modi taking control of the region on October 31. However, it has emerged that China President Xi Jinping has pushed increasingly audacious foreign policy over Ladakh, with analysts concerned that New Delhi may be losing control in the region.\n\nAshok Malik, distinguished fellow of New Delhi’s Observer Research Foundation told the Financial Times: \"Even in hitherto uncontested parts of Ladakh, the superiority of Chinese infrastructure and military capacities has seen a creeping takeover of border areas. “It is as if the effective line of actual control keeps moving a couple of inches in the direction of India. At some point, India has to say, ‘thus far and no further’.” It is also believed that Chinese military intervention in the region is breaching areas overseen by Modi's administration.\n\nBrahma Chellaney, a professor of strategic studies at New Delhi’s Centre for Policy Research told the Financial Times: \"Even before the Indian action on Jammu and Kashmir, the line of actual control between China and India in Ladakh had already become more active because of increasing Chinese aggressiveness. “In the 12 months prior to August, there had been a sharp increase in the number of Chinese military forays and incursions, and the Chinese have laid claim to several areas that are currently under Indian administrative control.\" DON'T MISS:\n\nIndia-Pakistan crisis: Fears of war after cross-border shelling [INSIGHT]\n\nIndia-Pakistan conflict: Modi's office targets Turkish shipyard  [ANALYSIS]\n\nSouth China Sea tensions surge: Vietnam urges India to back them [BREAKING]\n\nThis weekend, Xi Jinping will visit New Delhi for talks with Modi, with the situation in Kashmir bound to be a talking point with the two leaders looking to come to a compromise. Words have been strong between the two leading up to the meeting- on Wednesday New Delhi said it did not welcome comments on its internal matters in response to a reference to \"relevant\" UN resolutions after Xi's meeting with Pakistan Prime Minister Imran Khan this week.", "article title": "China and India face off in Kashmir as Beijing stamps authority in region", "meta information": {"meta description": "CHINA and India have been contesting ownership of territory in the Ladakh region of Kashmir and now Beijing is forcibly stamping its authority ahead of crunch talks this weekend.", "publish date": "2019-10-10T15:10:00+01:00", "image": "https://cdn.images.express.co.uk/img/dynamic/78/750x445/1189025.jpg", "authors": ["Charlie Bradley"], "meta keywords": ""}}