{"text": "BEIJING (Reuters) - China Investment Corp (CIC) reported a 37% dive in annual profit on Friday and said the ongoing Sino-U.S. trade war has made the Chinese sovereign wealth fund more cautious about investing in the United States.\n\nChina and the United States have enmeshed in a tit-for-tat trade war for more than a year that has led to escalating import tariffs at a time of slowing global economic growth.\n\nThe trade war “is making us more cautious about investing in the U.S.,” CIC President Ju Weimin said at a news conference in Beijing after the fund reported its annual earnings.\n\nThe fund “will not pose a threat to the countries it invests in, we insist on legal compliance,” said Ju, adding the wealth fund will reduce the riskiest assets in its portfolio, and seek opportunities in industries such as manufacturing, technology, telecommunications and healthcare.\n\nCIC is a shareholder in China’s largest banks including China Development Bank Corp and Industrial and Commercial Bank of China Ltd (1398.HK) (601398.SS).\n\nIt posted a 37.2% fall in 2018 net profit at $65.06 billion, citing a complex global financial environment and market turmoil. Its total investment income was fell 40.7% to $67.84 billion.\n\n“The global economy and financial situation is complex, international capital markets are in turmoil, the risk for assets is growing,” said Chairman Peng Chun, who described the current Sino-U.S. relationship as “delicate”.\n\nThe fund “feels a lot of pressure,” Peng said, adding CIC’s long-term returns outlook is stable.\n\nCIC booked a minus 2.35% net return on overseas investments last year, versus 17.59% in 2017. However, its annualized accumulative investment return for 2008 to 2018 was 6.07%, exceeding the fund’s performance review target, Peng said.\n\nThe fund has invested in 44 projects worth $26 billion under the government’s Belt and Road international trade route initiative as at the end of August, said Ju.\n\n“Some countries have tightened their investment oversight,” said Peng, adding Chinese investment entities have faced prejudicial treatment due to increased protectionism.\n\nCIC neverthelss plans to actively engage in cross-border investment such as multilateral funds, Peng said.\n\nHeadquartered in Beijing, CIC was founded in 2007 to help China earn a higher return on its foreign exchange reserves. It managed 4.3 trillion yuan ($607.01 billion) worth of state assets as at the end of 2018, its earnings report showed.\n\nDomestically, CIC plans to strengthen its role in the management of state-owned assets, said Peng, and the most important part of that role is to minimize financial risk.\n\nEarlier this year, through CIC unit Central Huijin Investment Ltd, the fund said it will act as a strategic investor in struggling Hengfeng Bank, as part of a state rescue initiative to support highly indebted smaller banks and contain financial risk.\n\nAsked about Central Huijin’s future rescue plans, Peng said: “CIC will step up its role as a platform to resolve and rescue high-risk institutions through market-oriented ways. Resolving financial risks is a new norm and will be a long-term job for us.”\n\nHe said such rescue efforts would not change the market position of Central Huijin.", "article title": "China sovereign fund CIC says cautious of investment amid trade war", "meta information": {"meta description": "China Investment Corp (CIC) reported a 37% dive in annual profit on Friday and said the ongoing Sino-U.S. trade war has made the Chinese sovereign wealth fund more cautious about investing in the United States.", "publish date": "2019-09-20T12:12:14+0000", "image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "authors": ["Min Read", "Cheng Leng"], "meta keywords": "US,CHINA,CIC,Funds,International Trade,Financials (TRBC),Financials (Legacy),China (PRC),Asia / Pacific,Major News,Debt / Fixed Income Markets,Sovereign Wealth Funds,Emerging Market Countries,United States"}}