{"text": "BEIJING (Reuters) - The sports network ESPN faced fresh criticism of its coverage of a row between the National Basketball Association (NBA) and China after using a map that appeared to endorse the country’s claims to both Taiwan and disputed territories in the South China Sea.\n\nA now-deleted tweet by Houston Rockets general manager Daryl Morey last week supporting anti-government protests in Hong Kong has sparked a massive backlash in China，with a fan event canceled and Chinese partners cutting ties with the NBA.\n\nAn ESPN broadcast on Wednesday morning in the United States showed a map of China that included both Taiwan, a self-ruled island that Beijing regards as a renegade province, and the so-called “nine-dash line,” a feature used on official Chinese maps to illustrate disputed claims to vast expanses of the strategically important South China Sea.\n\nThe use of the map, which had a ten-dash version of the line, was visible in a video uploaded to YouTube by an ESPN journalist.\n\nAn ESPN broadcast earlier in the week had used a map of China that did not include those features.\n\nChina has never renounced the use of force to bring democratic Taiwan under its control. All maps published in China must show Taiwan as one of the country’s provinces.\n\nChina, the Philippines, Vietnam, Taiwan, Malaysia and Brunei all have territorial claims in the South China Sea, making it one of the biggest potential flashpoints in the Asia-Pacific region.\n\nESPN, which has a multibillion-dollar content rights deal with the NBA, had already faced strong criticism online this week after a report that its anchors had been forbidden from talking about the political side of the row.\n\nSports news website Deadspin published a story on Tuesday that said that an internal memo from Chuck Salituro, ESPN’s senior news director, had forbidden anchors from discussing the political situation in Hong Kong, telling them to focus on the sports angle instead.\n\nAn ESPN source with knowledge of the matter said that emails to employees from Salituro had reiterated ESPN’s stance that politics should only be discussed as it related to sports. This stance has been in place for a year and a half, the source said.\n\nESPN did not respond to a request for comment on the use of the map.\n\nWalt Disney Co (DIS.N), which owns 80% of ESPN, did not respond to requests for comment on the use of the map or the Deadspin report.", "article title": "ESPN criticized over China-NBA coverage for using 'nine-dash line' map", "meta information": {"meta description": "The sports network ESPN faced fresh criticism of its coverage of a row between the National Basketball Association (NBA) and China after using a map that appeared to endorse the country's claims to both Taiwan and disputed territories in the South China Sea.", "publish date": "2019-10-10T09:57:26+0000", "image": "https://s2.reutersmedia.net/resources/r/?m=02&d=20191010&t=2&i=1439206815&w=1200&r=LYNXMPEF990QD", "authors": ["Gabriel Crossley", "Min Read"], "meta keywords": "US,CHINA,BASKETBALL,NBA,ESPN,Hong Kong,Company News,Basketball,China (PRC),Media and Publishing (TRBC),NBA Basketball,Government / Politics,General News,Sport,Asia / Pacific,Major News,Freedom of Speech / Censorship,Leisure and Recreation (TRBC),Media / Publishing (Legacy),Conflicts / War / Peace,Emerging Market Countries,United States"}}