{"text": "(Reuters) - Global media coverage of petrol bombs, tear gas and street clashes in Hong Kong days before China wants to celebrate the 70th anniversary of the founding of the People’s Republic presents Beijing with a major public relations challenge.\n\nMillions of anti-government protesters have taken to Hong Kong’s streets for more than three months, plunging the Chinese-ruled city into its biggest crisis in decades and posing a direct challenge to its political masters in Beijing.\n\nFollowing are the key dates in Hong Kong’s protest movement and the most recent developments as reported by Reuters.\n\nSaturday Sept. 28 - The fifth anniversary of the “Umbrella” pro-democracy protests in 2014 that occupied parts of the city for 79 days. Activists are expected to mark the event with a rally in the evening at Chater Garden next to government headquarters.\n\nSunday Sept. 29 - Demonstrators plan to march from the bustling shopping and tourist district of Causeway Bay to government headquarters.\n\nMonday Sept. 30 - Activists plan a citywide general strike, calling for “no work, no lessons, no selling, no shopping.”\n\nTuesday Oct. 1 - The 70th anniversary of the founding of the People’s Republic of China. Protesters are expected to march dressed in black from Victoria Park in Causeway Bay to Chater Road near government headquarters, and authorities are likely to roll out a large security blanket as the Hong Kong government holds a low-key ceremony.\n\nActivists in Hong Kong also plan a rally outside the British Consulate and a “Black Balloon Carnival” in the shopping district of Tsim Sha Tsui.\n\nIn Beijing, President Xi Jinping will oversee a massive military parade through central Beijing. The Communist Party will be hoping the world see images of orderly troop formations and dancing civilians, rather than protests in Hong Kong.\n\nSept. 26 - Hong Kong protesters trap city leader Carrie Lam in a stadium for hours after she holds her first “open dialogue” with the people in a bid to end months of protests.\n\nSept. 22 - Hong Kong police fire tear gas to break up pro-democracy demonstrators who trashed fittings at a railway station and shopping mall.\n\nSept. 17 - Hong Kong leader Carrie Lam pledges to hold talks with the community to try to ease tensions.\n\nSept. 7 - Police fire tear gas for a second consecutive night after fending off airport protests.\n\nSept. 4 - Lam announces formal withdrawal of controversial extradition bill. Critics say it is too little, too late.\n\nSept. 1 - Hong Kong commercial centers paralyzed as protesters and police exchange petrol bombs and tear gas.\n\nAug. 31 - CCTV footage shows footage of police beating protesters on a train at Prince Edward metro station in Kowloon district as they cowered on the floor.\n\nAug. 12 - Hong Kong’s international airport grinds to a halt as protesters target terminals. China likens protests to terrorism.\n\nAug. 2 - Thousands of civil servants join anti-government protests, defying a warning from authorities to remain politically neutral.\n\nJuly 21 - Police fire rubber bullets and tear gas as demonstrations descend into chaos and protesters target Beijing’s representative office in city. Men wearing white T-shirts attack protesters at the Yuen Long metro station as they return from rally.\n\nJuly 14 - Clashes break out as tens of thousands of protesters escalate fight in suburbs.\n\nJuly 9 - Lam says extradition bill is “dead”. Critics are not convinced.\n\nJuly 1 - Hong Kong protesters smash up The Hong Kong legislative building, marking a direct challenge to Beijing.\n\nJune 9 - Hundreds of thousands rally in fresh wave of protests against the extradition bill.\n\nMay 11 - Scuffles break out in Hong Kong legislature between pro-democracy lawmakers and those loyal to Beijing.\n\nApril 28 - Tens of thousands take to the streets to protest against extradition bill.\n\nMarch 31 - Thousands march against proposed extradition bill, fearing an erosion of personal freedoms and the city’s status as an international business hub.\n\nFeb. 2019 - Hong Kong government announces it is considering a bill that would allow criminal suspects in Hong Kong to be extradited to mainland China for trial in courts controlled by the Communist Party.", "article title": "Factbox: What's next for Hong Kong's protest movement", "meta information": {"meta description": "Global media coverage of petrol bombs, tear gas and street clashes in Hong Kong days before China wants to celebrate the 70th anniversary of the founding of the People's Republic presents Beijing with a major public relations challenge.", "publish date": "2019-09-27T07:56:55+0000", "image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "authors": ["Min Read", "Reuters Editorial"], "meta keywords": "US,HONGKONG,PROTESTS,KEYDATES,Crime / Law / Justice,Hong Kong,Society / Social Issues,Factboxes,Diplomacy / Foreign Policy,China (PRC),Government / Politics,Fundamental Rights / Civil Liberties,General News,Asia / Pacific,Major News,Human Rights / Civil Rights,Emerging Market Countries,Civil Unrest"}}