{"text": "HONG KONG (Reuters) - Hong Kong authorities are preparing for a day of chaos on the city’s streets on Tuesday, the 70th anniversary of the founding of the People’s Republic of China, and metro stations and malls will close ahead of protests that they fear could turn violent.\n\nThere will be a “very serious violent attack,” the chief superintendent of the police’s public relations branch, Tse Chun-chung, told a news conference on Monday. “We are on the verge of extreme danger.”\n\nPolice said they arrested a total of 157 people, including 67 students, after a chaotic weekend in which tear gas and water cannon were fired at protesters who set fires and threw petrol bombs. Eight police officers were injured, they said.\n\nAuthorities are eager to avoid scenes that could embarrass the central government in Beijing on the eve of the anniversary after months of sometimes violent pro-democracy protests. Police said several major roads will be closed on Tuesday near the Hong Kong Convention and Exhibition Centre, where a flag-raising ceremony is scheduled to take place.\n\nAuthorities on Monday rejected a permit for a march planned for Tuesday from Victoria Park in the bustling tourist district of Causeway Bay to Chater Road, next to government headquarters, on security grounds. Demonstrations are expected across Hong Kong regardless.\n\nAdmiralty, Wan Chai, and Prince Edward metro stations will be closed, Mass Transit Railway (MTR) said on Monday. The airport-bound express train will only stop at the central Hong Kong station, and only people with air tickets will be allowed entry to the terminal.\n\nSeveral shopping malls - including Elements in Tsim Sha Tsui and Telford Plaza in Kowloon Bay - have said they will close their doors.\n\nThe airport has previously been a target of protesters. Some demonstrations in shopping malls have ended in violence.\n\n“Members of the public are reminded to remain vigilant and mind their own safety,” a government spokesman said on Monday.\n\nA huge clean-up was under way on Monday after roads, shops and buildings across the financial center were daubed in graffiti, windows in government buildings smashed and parts of pavements uprooted by protesters at the weekend.\n\nSome underground stations were vandalized and streets strewn with debris from roadblocks and the charred remains of fires.\n\nAn Indonesian journalist was hit in the eye by a rubber bullet and hospitalized on Sunday. The Indonesian Consulate confirmed that one of its citizens had been injured. A lawyer for the journalist said in a statement she was “lucky to be alive”.\n\nTwo prominent democracy activists, actor Gregory Wong and Ventus Lau, were arrested for their involvement in protests on Monday, according to a representative for the Civil Human Rights Front (CHRF), the organizer of previous mass protests.\n\nHong Kong police did not immediately confirm the arrests.\n\nThe city’s leader, Carrie Lam, the focus of the unrest, made a last-minute decision to go to Beijing to mark the People’s Republic anniversary. The embattled leader had sent out invitations “requesting the pleasure of your company” at the flag-raising ceremony and a reception in Hong Kong on Tuesday.\n\nIt was not clear whether Lam had been summoned to Beijing due to the weekend’s violence. The government said Chief Secretary for Administration Matthew Cheung Kin-chung would stand in for her at the ceremony.\n\nChinese President Xi Jinping made brief mention of Hong Kong at a National Day reception in the Great Hall of the People on Monday, saying it would have a bright future. He did not directly refer to the protests.\n\n“I believe that with the motherland’s full support, and the joint efforts of all compatriots who love the country, Hong Kong and Macao, Hong Kong and Macao will develop and progress together with the mainland and become better places in the future,” he said.\n\nChina has assembled its largest active force of People’s Liberation Army (PLA) troops and other anti-riot personnel and equipment in Hong Kong, quietly doubling troop numbers in recent weeks, according to foreign envoys, Reuters reported on Monday. here\n\nSecurity was tight on Monday around the Convention Centre after a weekend of some of the worst and most widespread violence in more than three months of anti-government demonstrations in the Asian financial hub.\n\nProtesters are angry about what they see as creeping interference by Beijing in their city’s affairs despite a promise of autonomy when British rule ended in 1997.\n\nThe trigger was planned legislation, now withdrawn, that would have allowed people to be sent to mainland China for trial, despite Hong Kong having its own much-respected independent judiciary. The protests have since broadened into calls for universal suffrage.\n\nThe weekend marked the fifth anniversary of the start of the “Umbrella” protests - pro-democracy demonstrations in 2014 that failed to wrest concessions from Beijing.\n\nThe clashes began mid-afternoon on Sunday and went on into the night. Thousands of masked protesters roamed the streets, facing off against riot police amid plumes of tear gas and raging fires.\n\nPolice said an officer fired a warning shot after they were “surrounded and attacked by a large group of violent protesters”.\n\nBy early morning on Monday all MTR metro stations on the city’s main island were open, but staff could be seen repairing damage and clearing debris.\n\nWorkers at a Starbucks store were shoveling broken glass into garbage bags and peeling anti-China posters off the walls. Starbucks stores in Hong Kong are run by the Maxim’s Group, which has drawn ire after Annie Wu, the daughter of the founder, criticized the protests during an appearance at the United Nations earlier this month.", "article title": "Hong Kong braces for 'violent attack' on sensitive Chinese anniversary: police", "meta information": {"meta description": "Hong Kong authorities are preparing for a day of chaos on the city's streets on Tuesday, the 70th anniversary of the founding of the People's Republic of China, and metro stations and malls will close ahead of protests that they fear could turn violent.", "publish date": "2019-09-30T16:11:27+0000", "image": "https://s2.reutersmedia.net/resources/r/?m=02&d=20190930&t=2&i=1435518699&w=1200&r=LYNXMPEF8T0SF", "authors": ["Min Read", "Donny Kwok"], "meta keywords": "US,HONGKONG,PROTESTS,Hong Kong,Taiwan,Diplomacy / Foreign Policy,China (PRC),Government / Politics,Transportation (TRBC),Video,European Union,Fundamental Rights / Civil Liberties,Asia / Pacific,Major News,Human Rights / Civil Rights,Europe,United Nations,United Kingdom,Pictures,International / National Security,Emerging Market Countries,Civil Unrest,United States"}}