{"text": "Mrs. Lam emphasized repeatedly at a news conference that she was not declaring an emergency, but was acting under a provision in the territory’s colonial-era law that allows the issuance of regulations in response to “a state of serious danger.”\n\n“We are particularly concerned that many students are participating” in violent protests, “jeopardizing their safety and even their future,” she said. “As a responsible government, we have a duty to use all available means to stop the escalating violence and restore calmness in society.”\n\nThe ban on face masks will be punishable by up to one year in jail and a fine. It will apply to public gatherings of more than few dozen people. But enforcing the ban could prove difficult given their near ubiquity in the movement. Face masks are a common feature among the crowds of protesters, both for security and safety.\n\nMany protesters wear gas masks and respirators, as do first aid responders and journalists, to protect themselves from tear gas that the police deploy to disperse crowds that engage in violence. Some wear them to protect their identity, fearful they will be captured in photos and by surveillance equipment, then targeted for retaliation.\n\nFew people attend mass gatherings without one, even during peaceful marches and demonstrations. When Mrs. Lam held her first town hall with residents last week, many members of the audience who confronted her with difficult questions wore masks.\n\nBut the face masks, and the anonymity they provide, have given cover to more violent protesters, who have beaten police officers and vandalized property. Undercover police officers have also used masks to disguise themselves as protesters and make arrests.", "article title": "Hong Kong Banned Masks at Protests. Masked Crowds Protested the Ban.", "meta information": {"meta description": "Thousands protested, many wearing masks, as the clock ticked toward the ban taking effect, and clashes broke out around the city.", "publish date": null, "image": "https://static01.nyt.com/images/2019/10/04/world/04hk-emergency-4/merlin_162099690_f6263543-24c0-434a-847c-8b0ddec1504e-articleLarge.jpg?quality=75&auto=webp&disable=upscale", "authors": ["Keith Bradsher"], "meta keywords": ""}}