{"text": "Microsoft broke new ground when it introduced its touchscreen Surface tablet / laptop hybrid back in 2012, and it hasn’t stopped since. This year, the company seems to be pulling out all the stops: its event at the Starrett-Lehigh Building in New York City looks like it will introduce some major innovations.\n\nWhy tune in? Because you can probably expect to see new products and interesting device refreshes for the Surface line. These may include a Surface laptop powered by Qualcomm’s new ARM chip and one that offers dual-screen capabilities. There are also rumors about a new speaker and a consumer version of Teams, Microsoft’s answer to Slack.\n\nWhatever the company plans to announce, we’ll be covering it. You can follow the event via the live stream, and enjoy our live blog where The Verge’s writers will keep things lively with their observations and opinions. It’s all happening today, October 2nd, starting at 10AM ET / 7AM PT. Here are the details:\n\nLive blog: Tune in to The Verge’s live blog for the latest on Microsoft’s event, expert commentary, and photos from the Starrett-Lehigh Building in New York City.\n\nLive stream: Microsoft is live-streaming the event on YouTube or on its website for desktop viewing.\n\nLive tweeting: Follow @verge on Twitter for the highlights and new products introduced at Microsoft’s Surface event.\n\nLive Instagram updates: Keep an eye on @verge on Instagram for live updates from our team.", "article title": "How to watch Microsoft’s 2019 Surface event", "meta information": {"meta description": "We expect to see new products and interesting device refreshes for the Surface line. These may include a Surface laptop powered by Qualcomm’s new ARM chip and one that offers dual-screen capabilities. There are also rumors about a new speaker and a consumer version of Teams, Microsoft’s answer to Slack.", "publish date": "2019-10-02T06:00:00-04:00", "image": "https://cdn.vox-cdn.com/thumbor/WgYrQ-N1-q2Nh1E2i1TPWNJiR84=/0x146:2040x1214/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/13273569/akrales_181012_3019_0072.jpg", "authors": ["Barbara Krasnoff", "Oct Edt"], "meta keywords": ""}}