{"text": "BEIJING/SHANGHAI (Reuters) - Apple’s latest iPhone 11 range hit stores in China on Friday, with short queues of die-hard fans contrasting with the hundreds who camped out ahead of some previous launches.\n\nThe sales performance of the U.S. tech giant’s latest line-up is being closely watched in the world’s largest smartphone market, where Apple has been losing ground to competitors with cheaper and feature-packed handsets in recent years.\n\nThe queues at the Shanghai and Beijing stores, which combined added up to few dozen customers, were in sharp contrast to previous years, when hundreds used to wait for hours outside Apple’s shops to be the first to grab its latest offerings.\n\nBut much of the fanfare in China has moved online where the pre-sales for iPhone 11, priced between $699 and $1,099, started last week.\n\nAnalysts said they had gotten off to a better start than the last cycle a year ago. Chinese e-commerce site JD.com said day one pre-sales for the iPhone 11 series were up 480% versus comparable sales for the iPhone XR last year.\n\nAmong customers that took to a store in Beijing on Friday to make a purchase in person was a programer who only gave his surname as Liu, who said he had a model from every Apple series since the 3G range.\n\nHe said he was particularly attracted to the more expensive iPhone 11 Pro, which has three cameras on the back. “When it comes to taking photos, it’s better for night shots and the image is clearer,” he told Reuters.\n\nOther customers, however, said that they were concerned that the range was not enabled for fifth-generation networks, putting them behind 5G models already released by China’s Huawei Technologies [HWT.UL] and smaller rival Vivo, and expressed hopes that Apple could make it happen for its next line-up.\n\n“I think by the end of next year, especially in big cities like Beijing, 5G will be commonplace,” said civil servant Liu Liu. “If they don’t research this then they’ll lag way behind.”\n\nThe in-store launch of the iPhone 11 in China came a day after Chinese smartphone maker Huawei unveiled new smartphones which it said were more compact, with more sensitive cameras and wraparound screens more vivid than those of the latest iPhone, though it played down concerns about the lack of access to Google’s popular apps.\n\nHuawei has experienced a surge in support from Chinese consumers after the brand was caught up in a trade war between the United States and China, which has in turn eaten into Apple’s market share in the country.", "article title": "No crowds as Apple's iPhone 11 hits stores in China", "meta information": {"meta description": "Apple's latest iPhone 11 range hit stores in China on Friday, with short queues of die-hard fans contrasting with the hundreds who camped out ahead of some previous launches.", "publish date": "2019-09-20T16:05:01+0000", "image": "https://s4.reutersmedia.net/resources/r/?m=02&d=20190920&t=2&i=1431954374&w=1200&r=LYNXMPEF8J0TV", "authors": ["Min Read", "Reuters Editorial"], "meta keywords": "US,APPLE,IPHONE,CHINA,Computer and Electronics Retailers (TRBC),Company News,Western Europe,Software and IT Services (TRBC),Picture available,Arts / Culture / Entertainment,China (PRC),Software (TRBC),Video,Products / Services,Asia / Pacific,Major News,Europe,United Kingdom,Pictures,Emerging Market Countries,United States"}}