{"text": "BEIJING (Reuters) - China warned on Monday of instability in international markets from any “decoupling” of China and the United States, after sources said the Trump administration was considering delisting Chinese companies from U.S. stock exchanges.\n\nThe move would be part of a broader effort to limit U.S. investment in Chinese companies, two sources briefed on the matter told Reuters last week, in what would be a radical escalation of U.S.-China trade tensions. The news had earlier been reported by Bloomberg..\n\nA third source said the delisting idea was motivated by growing security concerns within the administration of U.S. President Donald Trump over Chinese companies’ activities.\n\nWhite House trade adviser Peter Navarro on Monday dismissed the reports as “fake news.”\n\n“That story, which appeared in Bloomberg: I’ve read it far more carefully than it was written,” Navarro told CNBC. “Over half of it was highly inaccurate or simply flat-out false.”\n\nShares of U.S.-listed Chinese stocks reversed direction on Monday after a sharp fall on the delisting reports. Alibaba Group Holding Ltd (BABA.N) and JD.Com Inc (JD.O) rose 2% each in early trading after tumbling more than 5% on Friday.\n\nAlso on Monday, e-learning firm Youdao Inc became the latest Chinese company to file for an initial public offering in the United States. Chinese online pharmacy Ecmoho filed to list its shares on the Nasdaq last week.\n\nEcmoho is planning to start pre-marketing next week, IFR reported, citing people familiar with the matter. The company was not immediately available for comment.\n\nEarlier in the day, stocks in China fell to their lowest in almost a month on the reports, which came at a sensitive time ahead of celebrations on Tuesday to mark 70 years since the founding of the People’s Republic of China.\n\nChinese Foreign Ministry spokesman Geng Shuang told a daily news briefing on Monday he had noted the response from the U.S. Treasury, which said there were no plans to block Chinese listings “at this time”.\n\n“Exerting maximum pressure and even seeking the forced decoupling of China-U.S. relations will harm the interests of Chinese and American companies and people, create turmoil in financial markets, and endanger global trade and economic growth,” Geng added.\n\n“This does not accord with the interests of the international community.”\n\nGeng said he hoped that the United States would take a “constructive attitude” toward resolving differences.\n\nThe United States and China have been locked in an escalating trade war for nearly 15 months. They have levied punitive duties on hundreds of billions of dollars of each other’s goods, roiling financial markets and threatening global growth.\n\nIn June, U.S. lawmakers from both parties introduced a bill to force Chinese companies listed on American stock exchanges to submit to regulatory oversight, including providing access to audits, or face delisting.\n\nChinese authorities have long been reluctant to let overseas regulators inspect local accounting firms - including member firms of the Big Four international accounting networks - citing national security concerns.\n\nChina and the United States are due to resume high-level trade talks next week in Washington.\n\nIn advance of the talks, Chinese firms bought up to 600,000 tonnes of U.S. soybeans for shipment from November to January on Monday, two sources with knowledge of the deals said. The purchases form part of a tariff-free quota allotted for up to 2 million tonnes this week. China has frequently made goodwill purchases of U.S. agricultural goods ahead of trade talks.\n\nChina hopes Beijing and Washington will resolve their trade dispute “with a calm and rational attitude”, Vice Commerce Minister Wang Shouwen, who has been part of China’s negotiating team, said on Sunday.", "article title": "On delisting threat, China says 'decoupling' would harm both sides", "meta information": {"meta description": "China warned on Monday of instability in international markets from any \"decoupling\" of China and the United States, after sources said the Trump administration was considering delisting Chinese companies from U.S. stock exchanges.", "publish date": "2019-09-30T22:53:34+0000", "image": "https://s4.reutersmedia.net/resources/r/?m=02&d=20190930&t=2&i=1435459409&w=1200&r=LYNXMPEF8T0EZ", "authors": ["Min Read", "Michael Martina"], "meta keywords": "US,USA,TRADE,CHINA,LIMITS,Company News,International Trade,Initial Public Offerings,Diplomacy / Foreign Policy,China (PRC),Equity Investments,Volatile Shares / Hot Stocks,Government / Politics,Video,Soybean,Asia / Pacific,Market Events,Major News,Equities Markets,US Government News,Pictures,International / National Security,Emerging Market Countries,United States"}}