{"text": "In 2001, Gordon Chang, an American lawyer who had spent many years in Hong Kong and Shanghai, published a book forebodingly titled “The Coming Collapse of China.” At the time, the thesis seemed improbable, if not preposterous.\n\nIt looks a great deal less improbable now.\n\nChina — or, rather, the Chinese regime — is in trouble. Tuesday’s gigantic parade in Beijing to celebrate the 70th anniversary of the People’s Republic looked like something out of the late Brezhnev era: endless military pomp and gray old men. Hong Kong is in its fourth straight month of protests, marked and stained by this week’s shooting of a teenage demonstrator. The Chinese economy is growing at its slowest rate in 27 years, even when going by the overstated official figures.\n\nMeantime, capital is fleeing China — an estimated $1.2 trillion in the past decade — while foreign investors sour on Chinese markets. Beijing’s loudly touted Belt-and-Road initiative looks increasingly like a swamp of corruption, malinvestment and bad debt. Its retaliatory options in the face of Donald Trump’s trade war are bad and few. And General Secretary Xi Jinping has created a cult-of-personality dictatorship in a style unseen since Mao Zedong, China’s last disastrous emperor.\n\nRemember the “Chinese Dream” — Xi’s vision of China as a modern, powerful, and “moderately well-off” state? Forget it. The current task for Chinese leadership is to avoid a full-blown nightmare of international isolation, economic decline, and domestic revolt.", "article title": "Opinion | Is China Heading for Crisis?", "meta information": {"meta description": "The protests in Hong Kong accelerate the contradictions in Beijing.", "publish date": null, "image": "https://static01.nyt.com/images/2019/10/03/opinion/03stephensWeb/merlin_161940225_d01efe35-bae7-41d8-8ce3-dd8193d4a118-articleLarge.jpg?quality=75&auto=webp&disable=upscale", "authors": ["Bret Stephens"], "meta keywords": ""}}