{"text": "Dezeen's Benedict Hobson picks out six Chinese design studios and brands that made an impression at the Design China Beijing trade show earlier this month.\n\nDesign China Beijing featured over 200 exhibitors including a host of international brands, but also a significant contingent of design studios and companies based in China.\n\n\"We want Design China Beijing to become the platform that fosters design discourse and addresses the critical issues facing Chinese designers and brands today,\" show director Tan Zhuo told Dezeen.\n\nThe fair featured several emerging Chinese studios and brands, alongside more established names, each of which draw from Chinese culture in different ways to produce contemporary furniture and lighting.\n\nHere is Dezeen chief content officer Hobson's selection of the top six Chinese designers and brands at the show:\n\nLocal designer Frank Chou presented a trio of new products at Design China Beijing – a new lamp, a coffee table and a seating collection called Combo.\n\nComprising a sofa and an armchair, the series features rectangular cushions upholstered with fabrics in a variety of contrasting colours and textures.\n\n\"For me, furniture is very important. Furniture is a kind of sculpture in people's everyday life – sculpture you can touch, sculpture that you can surround yourself with,\" Chou told Dezeen.\n\nBorn and educated in Beijing, Chou has become one of China's best-known independent designers. He said he felt a responsibility to project a modern image of China to the world.\n\n\"I believe it's very important for our design to reflect that China has entered the modern world, so we use very clean lines – pure, simple, contemporary forms,\" he said. \"But you can tell that the products were born in China – not from a western country, or Japan.\"\n\nAbove is a young Hangzhou-based design brand founded by Rhode Island School of Design (RISD) graduates Xu Lu and Zhang Zihan in 2017.\n\nWinner of the Emerging Chinese Designer Award at sister show Design Shanghai earlier this year, Above designs, manufactures and sells its own products via an online store.\n\nThe studio's current products include a contemporary take on a traditional Chinese incense burner, as well as Float Clock, which features a delicate brass second hand that wraps around the edge of the clock's round wood face.\n\n\"Even though we studied at RISD, we have spent most of our lives in China, so there is a lot of Chinese culture and heritage embedded in our work,\" Xu told Dezeen. \"But we want to create products that appeal to customers around the world, not just in China.\"\n\nShiershiman is a furniture and lighting brand founded in 2015 in Shanghai by Zeng Qiang, a former advertising creative director.\n\nTaking traditional Chinese forms and motifs as a starting point for its designs, the brand creates contemporary furniture and lighting that caters to China's burgeoning middle class.\n\nBy carefully selecting local manufacturers and working with them to improve their production processes, the brand claims it is able to meet the same quality as imported products, but at a fraction of the cost.\n\n\"I want to create products that regular middle-class people can afford,\" Zeng told Dezeen.\n\n\"So our price point is not extremely high, but the quality is comparable to imported products that are priced two or three times higher.\"\n\nYemu1978 is a small family-run design studio founded in 2009 by father and daughter Ma Zhiping and Ma Shenglan.\n\nThe studio sources wood that has been discarded by industrial furniture manufacturers from around the world, which it uses to create bespoke cabinets, tables and other furniture for Chinese clients.\n\n\"Usually this kind of blemished wood would be discarded, it would be burned, but we use it in our designs to reveal how beautiful it is,\" Ma Shenglan told Dezeen.\n\n\"There is a lot of beauty in the wood itself, and we embrace the natural patterns and colours and cracks in the materials.\"\n\nAn interior designer for over 20 years, Zhu Zi founded the furniture brand Suyab in 2015.\n\nThe brand combines traditional materials like wood, bronze and leather with more modern materials, such as polished stainless steel, to create furniture that it manufactures at its own factories in Guangzhou.\n\n\"We use a combination of contemporary technology and materials, but also traditional materials with character, that reveal natural traces of use,\" Zhu told Dezeen.\n\n\"Over time, maybe the wood will crack. With leather, the more you use it, the more you see traces of its use. That's how we want it to be – to see the natural wear of the material.\"\n\nDesigner Liu Shaw founded her studio The Shaw after graduating from South China Normal University in Guangzhou in 2017.\n\nAt Design China Beijing, she exhibited a series of sculptural lighting products, including a series of hand-made polished stainless steel lamps called The Sanctuary.\n\nThe lamps feature glass globes that glow gently to create an ambient light, which Shaw likens to moonlight.\n\n\"I like the moon,\" Liu told Dezeen. \"The lamps are inspired by French architect Étienne-Louis Boullée's designs for a spherical cenotaph for Isaac Newton, which featured a glowing globe in the centre.\"", "article title": "Six of the best Chinese design studios and brands at Design China Beijing", "meta information": {"meta description": "Dezeen's Benedict Hobson picks out six Chinese design studios and brands that made an impression at the Design China Beijing trade show earlier this month.", "publish date": "2019-09-25T10:00:49+01:00", "image": "https://static.dezeen.com/uploads/2019/09/Combo-Frank-Chou-Design-China-Beijing_dezeen_01-852x852.jpg", "authors": ["Benedict Hobson"], "meta keywords": ""}}