{"text": "The chair dangles in a gallery titled “Before and After Tiananmen,” exploring themes of modernization and urbanization in the years around the 1989 massacre. It’s one of the bolder forays in the museum’s contemporary section, which makes heavy demands of American audiences less familiar with Chinese history.\n\n“We’re trying to look at this moment in ’89, and everything it represents about the changing nature of Chinese society and of Chinese art,” said Stuart Comer, the chief curator of media and performance. The era, he added, saw artists in Beijing “really embrace photography, video and performance. We’re still just beginning to address China properly.”\n\nNearly every curator I spoke to, when asked to name the museum’s most transformative undertaking of recent years, mentioned its in-house global think-tank, Contemporary and Modern Art Perspectives. Founded 10 years ago by Kathy Halbreich, MoMA’s recently departed associate director, C-MAP was the museum’s response to the Guggenheim, the Louvre and others establishing franchises in the Middle East and Asia.\n\nThe museum rejected the idea of multiple MoMAs, Mr. Lowry said, turning instead to what he called “self-education.” They invited over colleagues from Latin America, Eastern Europe, South and East Asia. More than 60 MoMA curators and researchers took regular trips to India, South Africa or Brazil. They were learning, listening, decentering themselves.\n\nIn a large new space overlooking West 53rd Street, Mr. Comer conferred with the artist Sheela Gowda, who’d come from Bangalore to set up a room-size installation, which joins thousands of carved wood figurines with the door jambs of torn-down houses. She is one of four Indian women included in MoMA’s initial collection display, and they are joined by artists from Colombia and Argentina, Sierra Leone and Morocco, Poland and Romania.\n\n“We are of our time, inevitably, and we don’t want to fight that,” said Ms. Temkin a few days later. “We want, we need, to be of it. Matisse said a great painter had to be of his time.”", "article title": "The New MoMA Is Here. Get Ready for Change.", "meta information": {"meta description": "The expanded Museum of Modern Art reopens this month, putting Picasso and Monet next to more recent, diverse artists. Will audiences embrace its new vision?", "publish date": null, "image": "https://static01.nyt.com/images/2019/10/06/arts/06moma10/06moma10-articleLarge.jpg?quality=75&auto=webp&disable=upscale", "authors": ["Jason Farago"], "meta keywords": ""}}