{"text": "The Trump administration originally said that it would approve licenses to continue selling to Huawei after Mr. Trump met with President Xi Jinping of China in Osaka, Japan, in June. But no licenses have since been issued, raising speculation that the administration was withholding them as leverage in trade talks.\n\nA spokesman from the Commerce Department, which is responsible for the licenses, said in an email that “as of right this moment, the status quo holds.”\n\nThe administration’s decision to allow licenses could help smooth the path to a trade deal. Negotiators from the United States and China are meeting in Washington this week for their 13th round of trade talks and officials are trying to agree on terms that would address Mr. Trump’s criticisms of China’s economic practices but still be acceptable to Beijing.\n\nMr. Trump has threatened to raise tariffs on $250 billion worth of Chinese goods this month and to impose another slew of tariffs in December if Beijing does not agree to concessions that Washington has been demanding. But some in the Trump administration have been eager to avoid further tariff increases and are pushing for a more limited agreement, which would end a trade war that has dragged on for more than a year.\n\nIt is not clear whether the president would agree to a limited pact or whether such a deal can be struck. China has continued to resist many of the administration’s demands to make more transformative changes to the way it runs its economy. The two countries have been on the cusp of an agreement before, only to have the arrangement fall apart.", "article title": "Trump Green-Lights Some Sales to Huawei", "meta information": {"meta description": "The administration plans to issue licenses allowing some American companies to sell nonsensitive products to Huawei, despite its placement on a U.S. blacklist.", "publish date": null, "image": "https://static01.nyt.com/images/2019/10/09/us/politics/09dc-trade/09dc-trade-articleLarge.jpg?quality=75&auto=webp&disable=upscale", "authors": ["Ana Swanson"], "meta keywords": ""}}