{"text": "Hong Kong Police shot a teen protester in the chest with live ammunition this morning, according to reports from journalists on the ground and a video that has gone viral on Facebook and Twitter. Video of the incident shows a Hong Kong police officer charging a crowd of protesters with his gun before firing a single shot.\n\n\n\nThe protester is reportedly in critical condition at Princess Margaret Hospital and will soon be transferred to Queen Elizabeth Hospital which has a cardiothoracic surgery center, according to the South China Morning Post.\n\nThe pro-democracy protester is a “Form Five” student at Tsuen Wan Public Ho Chuen Yiu Memorial College, according to SCMP, the equivalent of an 11th grader in the U.S., which would put his age somewhere around 16 years old.[Update: Police say he’s 18 years old]\n\nThe video of the shooting was captured by Campus TV in Hong Kong and shows the masked teenager approaching the police officer with a stick of some kind and swinging it at him, brushing his shirt.\n\nBut another angle on the shooting shows that the police charged at the protesters before they fought back. That video also shows the aftermath of the shooting, with the protester injured on the ground.\n\nAccording to SCMP, Hong Kong Police claim that the victim is 18 years old.\n\n“At about 4pm, a large group of rioters attacked police officers near Tai Ho Road, and they continued with their attack after officers warned them to stop. As an officer felt his life was under serious threat, he fired a round at the assailant to save his own life and his colleagues’ lives,” Police Senior Superintendent Yolanda Yu Hoi-kwan said in a Facebook message, according to SCMP. “The round hit an 18-year-old, and the area near his left shoulder was injured, and he was conscious when taken to Princess Margaret Hospital.”\n\n“The police force really did not want to see anyone being injured, so we feel very sad about this. We warn rioters to stop breaking the law immediately, as we will strictly enforce the law.”\n\nProtesters have been on the streets since June, when they were originally protesting a new law that would have made it easier for Beijing to extradite so-called criminals from Hong Kong to mainland China. Hong Kong is a semi-autonomous territory that has operated under a “one country, two systems” arrangement since 1997, but is scheduled to formally become part of China in 2047. The demands from protesters have widened since June and now include a call for universal suffrage.\n\n\n\nToday marks the 70th anniversary of the founding of the Chinese Communist Party, and celebrations are widespread in mainland China. But Hong Kongers have thrown a wrench in Beijing’s National Day celebrations by denouncing the brutality of the Chinese government. Today’s shooting by Hong Kong Police puts that brutality on full display.\n\nBeijing has done everything they can to stop the protests, including cyberattacks on protesters’ organizing tools. But Hong Kongers realize that this is a fight for their life and have vowed to never give up. Chinese state media was banned from running propaganda ads against the protesters, which prompted the Chinese government to complain that Facebook and Twitter were censoring China. The country, it should be noted, bans Facebook and Twitter behind China’s Great Firewall.\n\nUpdate, 8:10am: This post has been updated with a statement from Hong Kong Police.", "article title": "Viral Video Shows Hong Kong Police Shooting Teen Protester in the Chest", "meta information": {"meta description": "Hong Kong Police shot a teen protester in the chest with live ammunition this morning, according to reports from journalists on the ground and a video that has gone viral on Facebook and Twitter. Video of the incident shows a Hong Kong police officer charging a crowd of protesters with his gun before firing a single shot.", "publish date": null, "image": "https://i.kinja-img.com/gawker-media/image/upload/c_fill,f_auto,fl_progressive,g_center,h_675,pg_1,q_80,w_1200/hocwjn44lwvgfjhmjsvs.jpg", "authors": [], "meta keywords": "hong kong, protests, viral video, facebook, youtube, twitter, social media, democracy, beijing, Tsuen Wan Public Ho Chuen Yiu Memorial College"}}